[
    {
      "Name": "University of Aberdeen",
      "Overview": "The University of Aberdeen, located in Aberdeen, Scotland, is a historic institution founded in 1495, making it the third oldest university in Scotland and one of the oldest in the English-speaking world. It has a strong tradition of excellence in teaching, research, and innovation across a wide range of disciplines. With over 14,000 students from more than 130 countries, it boasts a diverse and international campus.",
      "History": "Founded in 1495 by William Elphinstone, Bishop of Aberdeen,\n the University of Aberdeen is Scotland's third oldest and the \nUK's fifth oldest university. Elphinstone established King's College\n to train doctors, teachers, clergy, and serve the Scottish Crown. \nThe college opened with 36 staff and students, covering arts, theology,\n law, and in 1497, became the first in the English-speaking world\n to create a chair of medicine. Inspired by European universities \nlike Paris and Bologna, many of the original traditions and buildings still remain today.\n",
      "Ranking & Achievement": "Consistently ranked among the top 200 universities in the world.\nRanked Aberdeen 236nd in the QS World University Rankings 2024.\nRanked 41th in the UK for student satisfaction (Complete University Guide 2023).\nStrong research profile with a high percentage of research rated world-leading or internationally excellent.",
      "courses": "Medicine (MBChB)\nLaw (LLB)\nComputer Science (BSc)\nEngineering (BEng)\nBusiness Management (BSc)\nInternational Relations (MA)\nEnvironmental Science (BSc)\nPsychology (BSc)\nMarine Biology (BSc)\nHistory (MA)",
      "Department & Faculty": "Aberdeen Centre for Electron Microscopy, Analysis and Characterisation\nScottish Biologics Facility (SBF)\nSchool of Biological Sciences\nIain Fraser Cytometry Centre (IFCC)\nElectrical and Electronic Engineering (EEE)\nMechanics labs\nCentre for Genome Enabled Biology and Medicine\nGeology and petroleum geology\nHuman Nutrition Unit\nMaxwell High Performance Computing cluster\nLighthouse Field Station\n",
      "Fee": "£19,400 to £25,100 ",
      "Services": "Student Support and Advice Service\nCareers and Employability Service\nCounseling and Wellbeing Service\nDisability Support Services\nIT and Computing Services\nInternational Student Advice Service\nStudy Abroad and Exchange Service\nLibrary and Information Services\nLanguage Centre\nSport and Fitness Facilities (Aberdeen Sports Village)",
      "Accommodation": "The University of Aberdeen offers a range of accommodation options, from self-catered to catered halls, on-campus and off-campus. Popular accommodation sites include Hillhead Student Village, which is located about 15 minutes from the main campus and offers a mix of en-suite rooms, standard rooms, and studio flats. All university accommodations include Wi-Fi, utilities, and access to common areas for socializing. ",
      "established": 1495,
      "rank": null,
      "location": " King's College, Aberdeen AB24 3FX, United Kingdom",
      "international student": 0.33,
      "country": "UK",
      "logo": "https://i.ibb.co.com/vmm1BCn/1.png"
    },
    {
      "Name": "University of Reading",
      "Overview": "The University of Reading is a prestigious institution located in the UK, known for its commitment to excellence in education and research. It offers a wide range of undergraduate and postgraduate programs across various disciplines, including arts, sciences, and social sciences. The university is recognized for its strong focus on sustainability and ethical practices, having been ranked first in the UK for its environmental performance. It emphasizes a vibrant student experience, encouraging personal and academic growth within a supportive community​.",
      "History": "The University of Reading was established in 1892 as\n a university college, gaining the status of a university in \n1926. Its roots can be traced back to the Reading School \nof Science and Art, founded in 1860. The university is known \nfor its strong emphasis on research and has evolved to offer \na wide range of undergraduate and postgraduate programs \nacross various disciplines. The university's commitment to \nteaching and learning excellence has earned it recognition\n in both national and international rankings​. \n",
      "Ranking & Achievement": "The University of Reading is currently ranked 169th in the QS World University Rankings 2024. This ranking reflects the institution's strengths in research and sustainability, as well as its commitment to making a positive social impact. The university has made notable advancements in areas like global engagement, reputation among employers, and attracting international students, positioning it within the top 200 globally​.",
      "courses": "BSc Accounting and Management\nBSc Economics\nBSc Environmental Science\nBA History\nBSc Computer Science\nBA English Literature\nBSc Psychology\nBSc Geography\nBA Politics and International Relations\nBA Primary Education (QTS)",
      "Department & Faculty": "School of Agriculture, Policy and Development\nSchool of Biological Sciences\nDepartment of Chemistry\nSchool of Built Environment\nHenley Business School\nSchool of Humanities\nDepartment of Law\nSchool of Psychology and Clinical Language Sciences\nDepartment of Politics and International Relations\nSchool of Mathematical, Physical and Computational Sciences",
      "Fee": "£19,500-£23,700",
      "Services": "Counselling and Wellbeing\nStudent Wellbeing Services\nDisability Advisory Service\nInternational Student Advisory Team\nStudent Financial Support Team\nCareers and Placements Team\nStudent Welfare Team\nAccommodation Services\nCampus Jobs\nSupport Centres",
      "Accommodation": "The University of Reading offers a range of accommodation options, including university-managed halls of residence and private housing. Students are guaranteed a place in halls if they meet certain criteria and apply by the specified deadlines. The accommodations come fully furnished and include essential amenities such as Wi-Fi, kitchen facilities, and laundry services. Meal plans are available to help students transition to university life, providing access to various dining outlets across campus​.",
      "established": 1892,
      "rank": "169th",
      "location": "Whiteknights House, Reading RG6 6UR, UK",
      "international student": 0.2,
      "country": "UK",
      "logo": "https://i.ibb.co.com/crCWTZQ/02-University-of-Reading.png"
    },
    {
      "Name": "University of Surrey",
      "Overview": "The University of Surrey, established in 1966, is a leading UK institution known for its focus on science, technology, and professional development. Located in Guildford, Surrey, it evolved from the Battersea Polytechnic Institute (founded in 1891), initially created to provide higher education to London’s working class. Today, Surrey is renowned for its strong emphasis on employability, research, and innovation, particularly in fields such as engineering, health sciences, business, and hospitality. The university is home to a diverse international community, with about 33% of its students coming from outside the UK. It offers excellent academic support, placements, and world-class facilities like the Surrey Sports Park.",
      "History": "The University of Surrey was officially established on 9 September \n1966 with its Royal Charter, but its origins date back to 1891 when \nBattersea Polytechnic Institute was founded to offer higher \neducation to London's poorer residents. By 1920, it focused on \nscience and technology, offering University of London degrees. \nIts academic reputation grew, and in 1956 it was designated as\n a \"college of advanced technology,\" becoming Battersea College of Technology in 1957. Due to space constraints, the college moved \nto Guildford in the 1960s, and following the 1963 Robbins Report, it transitioned into the University of Surrey, gaining its own degree-awarding powers.\n",
      "Ranking & Achievement": "Surrey is ranked 19th in the UK (Guardian University Guide 2025) and 285th globally (QS World University Rankings 2025). It has also been consistently recognized for its high student satisfaction and research excellence. Surrey ranks first in the UK for graduate employability and work placements, with over 95% of graduates entering employment or further studies after graduation.",
      "courses": "BEng (Hons) Mechanical Engineering\nBSc (Hons) Computer Science\nBSc (Hons) Economics and Finance\nBSc (Hons) Psychology\nBSc (Hons) International Hospitality and Tourism Management\nLLB (Hons) Law\nMEng (Hons) Aerospace Engineering\nBSc (Hons) Biomedical Science\nBSc (Hons) Criminology and Sociology\nMSc Data Science",
      "Department & Faculty": "Faculty of Arts and Social Sciences\nFaculty of Engineering and Physical Sciences\nFaculty of Health and Medical Sciences\nSurrey Business School\nSchool of Law\nSchool of Veterinary Medicine\nDepartment of Music and Media\nDepartment of Civil and Environmental Engineering\nSchool of Psychology\nSchool of Hospitality and Tourism Management",
      "Fee": " £19,000 to £24,000",
      "Services": "Library and Learning Centre (open 24/7)\nMySurrey Hive (student support hub)\nCareer Services\nSurrey Sports Park\nStudent Union (SU)\nInternational Student Support\nHealth and Wellbeing Services\nIT Services\nStudent Counselling\nDisability Support Services",
      "Accommodation": "Surrey offers over 6,000 study bedrooms on campus, with options ranging from budget to en-suite rooms. All first-year students who apply on time are guaranteed accommodation. The rooms are self-catered with shared kitchens and are monitored by security 24/7.",
      "established": 1966,
      "rank": " 285th ",
      "location": "Stag Hill, University Campus, Guildford GU2 7XH, UK",
      "international student": 0.33,
      "country": "uk",
      "logo": "https://i.ibb.co.com/HzDf1MJ/03-University-of-Surrey.png"
    },
    {
      "Name": "University of East Anglia",
      "Overview": "The University of East Anglia (UEA), founded in 1963 and located in Norwich, is renowned for its research focus and high student satisfaction. The campus features distinctive architecture, including the famous \"Ziggurats\" by Sir Denys Lasdun. UEA offers a wide variety of undergraduate and postgraduate programs, with its Creative Writing course being the first of its kind in the UK.\n\nRanked among the top 25 UK universities, UEA is particularly respected for its climate science and social science programs. The university promotes a vibrant student community and provides comprehensive support services, contributing to its strong satisfaction ratings ",
      "History": "The University of East Anglia (UEA) was founded in 1963 under Vice-Chancellor Frank Thistlethwaite, with the initial campus designed by Sir Denys Lasdun. His \"Ziggurats\" residences, inspired by French vineyards, are now Grade II listed architectural landmarks.\n\nIn 1971, UEA established the UK's first Creative Writing program, boasting alumni like Ian McEwan and Kazuo Ishiguro. The UEA Library holds over 800,000 books and a valuable Special Collections archive.\n\nUEA also became a pioneer in climate science with the founding of the Climatic Research Unit (CRU) by Hubert Lamb in the 1970s, contributing significantly to climate policy and IPCC reports.\n\nBy 1973, UEA had added Union House, the SU bar, LCR, and began excavating the Broad lake, while also launching its careers center.",
      "Ranking & Achievement": "The University of East Anglia (UEA) has improved its position in the Complete University Guide (CUG) 2025 rankings, rising from 23rd to 21st among UK universities, marking its highest rank since 2020. The CUG evaluates 130 institutions based on ten criteria, including entry standards, student satisfaction, research quality, and graduate prospects\n\nVice-Chancellor Prof. David Maguire expressed satisfaction with this achievement, highlighting UEA's comprehensive offerings and the collective effort of the university community in enhancing its reputation. Notably, UEA is ranked the best university in the UK for Counselling, Psychotherapy, and Occupational Therapy, outperforming nearly 50 other universities​. ",
      "courses": "Bachelor of Arts in Creative Writing\nBachelor of Science in Environmental Sciences\nBachelor of Arts in History\nBachelor of Science in Psychology\nBachelor of Arts in International Relations\nBachelor of Science in Business Management\nBachelor of Science in Nursing\nMaster of Science in Climate Change and International Development\nMaster of Arts in Film Studies\nBachelor of Science in Pharmacy",
      "Department & Faculty": "Faculty of Arts and Humanities\nFaculty of Medicine and Health Sciences\nFaculty of Science\nFaculty of Social Sciences\nLiberal Arts\n\n",
      "Fee": "£17,000 to £22,000",
      "Services": "24-hour Library\nIT and Wi-Fi Facilities\nMulti-faith Center\nStudent Health and Wellbeing Services\nCareer Services\nFitness Centre\nSainsbury Centre for Visual Arts\nOn-campus Medical and Dental Services\nStudent Union (Societies and Events)\nMental Health Support",
      "Accommodation": "Our award-winning student accommodation is central to our community.\n\nWe have over 4,300 rooms situated on the UEA campus providing high quality, affordable accommodation in beautiful surroundings.",
      "established": 1963,
      "rank": 33,
      "location": "Research Park, Norwich NR4 7TJ, UK",
      "international student": 0.195,
      "country": "UK",
      "logo": "https://i.ibb.co.com/R6tbWMJ/04-University-of-East-Anglia.png"
    },
    {
      "Name": "University of Exeter",
      "Overview": "The University of Exeter is a prestigious UK institution established in 1955, serving over 30,000 students, including a significant proportion of international learners. As a member of the Russell Group, the university emphasizes excellence in research and teaching​.\n\nExeter offers a diverse array of undergraduate and postgraduate programs across multiple disciplines, including humanities, sciences, and engineering. It consistently ranks among the top universities in the UK and worldwide, recognized for its academic performance​. The campuses in Exeter and Cornwall feature state-of-the-art facilities, fostering a supportive environment for students",
      "History": "In 1855, Sir Stafford Northcote pushed for a School of Art in Exeter to establish the city as a cultural center for the West of England. This was followed by the opening of the Devon and Exeter Albert Memorial Museum in 1868, which helped boost student enrollment.\n\nBy 1922, the institution moved to Streatham and was renamed the University College of the South West, achieving university status that same year with four faculties: Arts, Science, Social Studies, and Law. The 1960s brought significant growth, as applications exceeded available places. In 1962, Dr. David Mattingly became the inaugural director of Exeter's Postgraduate Medical School, enhancing connections with the local medical community.\n\nThe Northcott Theatre opened in 1967 on the Streatham campus, premiering with The Merchant of Venice. During this period, Exeter became a two-campus university with the merger of St Luke's College of Education, which had been established in 1840. By the end of the decade, student enrollment rose from 3,400 to nearly 5,200, solidifying Exeter's status as a credible alternative to Oxbridge.",
      "Ranking & Achievement": "The University of Exeter ranks between 11th and 18th among UK universities. In The Sunday Times’ 10-year average ranking (1998-2007), it was joint 26th overall. By 2016, Exeter reached 7th in The Times, 9th in The Guardian, and 10th in The Complete University Guide.\n\nExeter entered the Times Higher Education World University Rankings at 184th in 2010/2011, rising to 156th the following year. By 2015/2016, it ranked 93rd globally and 34th in the Leiden Rankings (2015).\n\nIn subject rankings, Exeter ranked 11th for public administration in the Academic Ranking of World Universities 2020, 10th for sport and health sciences, and 14th for engineering in minerals and mining in the QS World University Subject Rankings 2020. The university was named the Sunday Times University of the Year in 2013 and Times Higher Education University of the Year in 2007​",
      "courses": "MSc Data Science\nMA Social Media and Digital Marketing\nMSc Psychology\nMSc Engineering Business Management\nMSc Environmental Science\nMBA\nMSc Finance\nBSc Business Management\nMSc Advanced Computer Science\nMSc Public Health​",
      "Department & Faculty": "Faculty of Humanities\nFaculty of Health and Life Sciences\nFaculty of Social Sciences and International Studies\nFaculty of Engineering, Mathematics and Physical Sciences\nBusiness School\nFaculty of Law\nFaculty of Education\nFaculty of Arts\nFaculty of Psychology\nFaculty of Environmental Science​",
      "Fee": "\n£24,700-£47,500",
      "Services": "Academic support\nCareer services\nMental health support\nInternational student services\nAccommodation services\nSports and fitness facilities\nIT support\nLibrary services\nCounselling services\nStudent unions and societies​",
      "Accommodation": "The university provides various accommodation options across its campuses, ensuring that students have access to safe and comfortable living arrangements. Options include catered and self-catered halls of residence as well as student apartments​",
      "established": 1955,
      "rank": "14th for engineering in minerals and mining in the QS World University Subject Rankings 2020.",
      "location": "Stocker Rd, Exeter EX4 4PY, UK",
      "international student": 0.3,
      "country": "UK",
      "logo": "https://i.ibb.co.com/jgSPdmh/05-University-of-Exeter.png"
    },
    {
      "Name": "University of Dundee",
      "Overview": "The University of Dundee, located in Dundee, Scotland, is renowned for its strong focus on research and high-quality education. The university is recognized for its exceptional programs in medicine, life sciences, and art and design, offering a vibrant academic community and extensive resources for students.",
      "History": "The University of Dundee traces its origins to a university college established in the 19th century to meet the growing educational needs of the population in Dundee. Influential figures, including Miss Mary Ann Baxter, played a pivotal role in its founding through significant financial contributions aimed at promoting education in science, literature, and the fine arts.\n\nIn 1881, the vision for the college was formalized, leading to the establishment of \"University College, Dundee\" in 1883, with its first principal, Sir William Peterson. Initially, the college had five faculties focused primarily on scientific disciplines. Although it lacked the authority to award degrees at the outset, students were prepared for external examinations from the University of London.\n\nMary Ann Baxter's commitment to gender equality in education led to the recruitment of several notable female students, including social reformer Mary Lily Walker and Ruth Wilson, who would later become a prominent professor of surgery in India. The college eventually evolved, gaining full university status and reflecting its longstanding dedication to inclusivity and academic excellence​",
      "Ranking & Achievement": "As of 2024, the University of Dundee is ranked among the top 500 universities worldwide across major global rankings, placing between 301-350th in the Times World University Rankings and joint 441st in the QS World University Rankings. The university has been recognized as \"Scottish University of the Year\" by The Times Good University Guide in 2015/16 and 2016/17. Notably, in the 2021 Research Excellence Framework, Dundee's Biological Sciences ranked 2nd in the UK by GPA. Additionally, it boasts strong performances in specific subjects: Life Sciences and Law rank in the top 125 and top 150 globally, respectively, according to Times Higher Education. In the 2024 Guardian rankings, Dentistry and Computer Science are highlighted, ranking 3rd and 9th in the UK, with several other programs also placing within the top ten nationally",
      "courses": "Bachelor of Medicine, Bachelor of Surgery (MBChB)\nBSc in Adult Nursing\nLLB in Law\nBSc in Psychology\nBA in Architecture\nBSc in Civil and Structural Engineering\nBSc in Computer Science\nMSc in Biomedical Sciences\nBSc in Business Management\nBSc in Environmental Science",
      "Department & Faculty": "School of Humanities\nSchool of Medicine\nSchool of Dentistry\nSchool of Social Sciences\nSchool of Business\nSchool of Life Sciences\nSchool of Health Sciences\nSchool of Education and Social Work\nSchool of Science and Engineering\nDuncan of Jordanstone College of Art and Design",
      "Fee": "£20,100 to £25,000",
      "Services": "Academic support services\nCareer services\nInternational student support\nHealth and wellbeing services\nCounselling services\nAccommodation services\nLibrary services\nIT support\nFinancial advice\nSports and recreation facilities​",
      "Accommodation": "The University of Dundee provides various accommodation options, including university halls of residence and private housing. The residences are well-equipped, providing a supportive environment for students to live and study.",
      "established": 1881,
      "rank": "301-350th",
      "location": "Nethergate, Dundee DD1 4HN, UK",
      "international student": 0.24,
      "country": "UK",
      "logo": "https://i.ibb.co.com/PjDzWS0/06-University-of-Dundee.png"
    },
    {
      "Name": "Bath Spa University",
      "Overview": "Bath Spa University is located in the historic city of Bath, known for its Roman Baths and beautiful architecture. The university emphasizes a creative and supportive environment, making it a popular choice for students pursuing a variety of disciplines",
      "History": "Bath Spa University originated from the Bath School of Art, established in 1852, influenced by the Great Exhibition of 1851. In 1946, the Bath Teacher Training College opened on the Newton Park campus to address post-war teaching shortages, operating as a women's college under Principal Mary Dawson.\n\nIn 1975, it became Bath College of Higher Education following a merger with Bath Teacher Training College and Bath College of Domestic Science, with the Bath Academy of Art joining in 1983. The college gained degree-awarding powers in 1992 and rebranded as Bath Spa University College in 1997. Finally, in 2005, it was granted full university status and officially became Bath Spa University. By 2013, it was recognized as the UK's sixth-largest provider of teacher education",
      "Ranking & Achievement": "Guardian University League Table 2024: Ranked 94th out of 122 universities in the UK\nComplete University Guide 2024: Ranked 104th in the UK\n\nTimes Good University Guide 2024: Ranked in the top 100 universities in the UK\nNational Student Survey 2023: Bath Spa achieved an overall satisfaction score of 85%, ranking it among the higher education institutions​.",
      "courses": "BA (Hons) Creative Writing\nBA (Hons) Music\nBSc (Hons) Psychology\nBA (Hons) Graphic Communication\nBA (Hons) Film and TV Production\nBA (Hons) Education Studies\nBA (Hons) Theatre and Performance\nBA (Hons) Business Management\nBSc (Hons) Environmental Science\nMA Creative Arts and Mental Health​",
      "Department & Faculty": "Faculty of Education\nFaculty of Arts\nFaculty of Humanities and Social Sciences\nFaculty of Management\nFaculty of Science and Engineering\nFaculty of Creative Industries\nSchool of Music and Performing Arts\nSchool of Art and Design\nSchool of Humanities\nSchool of Psychology",
      "Fee": " £15,050 to £16,000",
      "Services": "Student support services\nAcademic support\nCareer services\nCounseling services\nFinancial advice\nIT support\nLibrary services\nAccommodation support\nHealth and wellbeing services\nInternational student support​",
      "Accommodation": null,
      "established": "We offer single, shared and en suite rooms, as well as private studio flats, across six different locations in Bath and at Newton Park campus.",
      "rank": "94th in the uk",
      "location": "Newton St Loe, Bath BA2 9BN, UK",
      "international student": 0.3,
      "country": "UK",
      "logo": "https://i.ibb.co.com/8mZzFFP/07-Bath-Spa-University.png"
    },
    {
      "Name": "University of Brighton",
      "Overview": "The University of Brighton is a prominent public university located along the south coast of England. Established in 1859, it has evolved into a multidisciplinary institution known for its civic responsibility and commitment to social relevance, offering courses that emphasize public good through local and global engagement.",
      "History": "The University of Brighton's origins trace back to 1859 when the School of Art opened with 110 students in a repurposed kitchen of the Royal Pavilion, thanks to the town council's support. The school moved to a new building at Grand Parade, with Prime Minister William Gladstone present for the foundation stone laying. In 1877, the new School of Science and Art opened with a grand ceremony attended by the Marchioness and Marquis of Lorne. By 1897, the Municipal School of Science and Technology was established, teaching 600 part-time students, primarily from building trades. The Chelsea School, founded in London in 1898, moved to Eastbourne in 1949 and later became part of Brighton Polytechnic in 1979. The Richmond Terrace site became home to Brighton Municipal Training College in 1909, initially training teachers, which eventually grew to 230 students by 1950.",
      "Ranking & Achievement": "The University of Brighton has risen to 70th place in the Guardian's national league table, a significant jump from 92nd the previous year. Over the past five years, the university has climbed over forty places. In the Guardian University Guide 2023, Brighton ranked in the top 10 for several subjects, including physiotherapy (2nd), economics (4th), education (6th), aerospace engineering (7th), and sports science (7th). Additionally, the university ranked 11th for 'value added,' which measures how effectively students are taught by comparing their degree results to entry qualifications. This reflects the success of its flexible admissions policy, which ensures equal opportunities for all applicants.",
      "courses": "M.Sc. Data Analytics\nB.A. Fashion Design\nB.Sc. Nursing\nM.Sc. Logistics and Supply Chain Management\nB.Eng. Civil Engineering\nB.A. Graphic Design\nB.Sc. Computer Science\nM.Sc. Mechanical Engineering\nB.A. History of Art and Design\nM.A. Architecture",
      "Department & Faculty": "School of Computing, Engineering, and Mathematics\nSchool of Humanities\nSchool of Art\nBrighton and Sussex Medical School (Joint partnership)\nSchool of Sport and Health Sciences\nSchool of Media\nSchool of Business and Law\nSchool of Pharmacy\nSchool of Education\nSchool of Architecture​",
      "Fee": "£15,900 to £16,900",
      "Services": "Career services\nLibrary access\nIT support\nSports facilities\nAlumni network\nStudent counseling\nFinancial aid and scholarships\nOn-campus healthcare\nDisability services\nInternational student support​",
      "Accommodation": "The university provides a variety of on-campus and off-campus accommodations, including self-catered residences. Brighton's accommodation is known for being in student-friendly neighborhoods and close to university facilities. Prices vary based on location and amenities",
      "established": 1859,
      "rank": "801-850 ",
      "location": "Brighton, Eastbourne , England",
      "international student": 0.23,
      "country": "UK",
      "logo": "https://i.ibb.co.com/rspYkdC/09-University-of-Brighton.png"
    },
    {
      "Name": "Canterbury Christ Church University",
      "Overview": "Our University started out as a teacher training college in the 1960s in response to a national shortage of teachers. Today we continue to shape our courses and research around critical social issues both nationally and globally.",
      "History": "Canterbury Christ Church College opened in 1962 as a teacher training institution to address a shortage of Church of England school teachers, starting with 75 students and nine teachers, led by Principal Dr. Frederic Mason. In 1964, the college moved to its new North Holmes Road site, and in 1965, it welcomed HRH Queen Elizabeth II for a visit. The early 1970s saw the introduction of its first degree program, the Bachelor of Education, while 1976 marked the launch of non-teaching degrees, starting with a BA in English with Religious Studies. The 1980s brought further diversification, including the first non-teacher education course in Radio, Film, and Television (RFTV) in 1980, and in 1987, health-related professional courses began with a diploma in Occupational Therapy. By 1988, student enrollment reached 1,500, and in 1989, the School of Nursing was integrated into the college through a merger with local nursing schools",
      "Ranking & Achievement": "Canterbury Christ Church University has proudly improved its standing in the 2022/23 People and Planet University League Rankings, moving from 78th to 42nd place among 153 UK universities assessed on environmental and ethical criteria. This significant leap of 36 places highlights the university's commitment to sustainability and responsible practices within the higher education sector",
      "courses": "BA (Hons) in Primary Education\nBSc (Hons) in Psychology\nBSc (Hons) in Nursing (Adult)\nBA (Hons) in Journalism\nBSc (Hons) in Computer Science\nBA (Hons) in English Language and Linguistics\nBA (Hons) in Business Management\nBSc (Hons) in Criminology\nBA (Hons) in Social Work\nMSc in Occupational Therapy",
      "Department & Faculty": "Faculty of Arts and Humanities\nFaculty of Education\nFaculty of Health and Wellbeing\nFaculty of Medicine, Health, and Social Care\nFaculty of Science, Engineering, and Social Sciences\nBusiness School",
      "Fee": "£13,000 to £45,000 ",
      "Services": "Augustine House Library\nPilkington Library\nSports Centre\nIT support and computer labs\nDisability support services\nMental health counseling\nCareers and employability services\nAcademic tutoring\nCatering and food outlets\nStudent union activities",
      "Accommodation": "Choosing to live in student accommodation at Canterbury Christ Church University (CCCU) offers a fantastic opportunity to make friends and fully engage in student life. The purpose-built accommodations in Canterbury and Medway provide 24/7 support, and all utility bills are included in the annual price, alleviating concerns about rising energy costs or setting up Wi-Fi. With various options available to suit different budgets, students can easily explore accommodations and even take virtual tours to find their ideal home",
      "established": 1962,
      "rank": " 153 UK ",
      "location": "N Holmes Rd, Canterbury CT1 1QU, UK",
      "international student": "8-10%",
      "country": "UK",
      "logo": "https://i.ibb.co.com/qdcTB6k/10-Canterbury-Christ-Church-University.png"
    },
    {
      "Name": "Cardiff Metropolitan University",
      "Overview": "Cardiff Met is proud of all its alumni and we continue to support you as you embark on life after university. \n\nWe provide early career guidance for recent graduates and aim to keep you connected throughout your career. We also provide opportunities for you to inspire our students by speaking at events or offering work experience opportunities, and this is just the tip of the iceberg! \n",
      "History": "Cardiff Metropolitan University has a rich history dating back to 1865, when the School of Art was established in the Old Free Library in Cardiff. Over the years, the institution has undergone numerous name changes, reflecting its evolving identity, and it became Cardiff Metropolitan University in 2011. The institution was previously known as the University of Wales Institute, Cardiff (1996-2011), Cardiff Institute of Higher Education (1988-1996), and several other names dating back to its origins as the Cardiff School of Science & Art. Throughout its history, the university has maintained its commitment to practice-focused, professionally oriented education for students worldwide​",
      "Ranking & Achievement": "The university has been consistently improving its ranking. It was ranked as the biggest climber in Wales in 2023 by the Good University Guide. Cardiff Met emphasizes sustainability, research excellence, and student experience",
      "courses": "Accounting & Finance (MSc)\nAdvanced Computer Science (MSc)\nBiomedical Science (MSc)\nCriminology and Criminal Investigations (MSc)\nCreative Writing (MA)\nEducation (Wales) (MA)\nFashion Design (MA)\nGlobal Design (MDes)\nInternational Business Management (MSc)\nSport & Exercise Science (MSc)",
      "Department & Faculty": "Cardiff School of Art & Design\nCardiff School of Education & Social Policy\nCardiff School of Management\nCardiff School of Sport & Health Sciences\nCardiff School of Technologies",
      "Fee": "£13,500 and £14,500",
      "Services": "Academic Support (Library & IT Services)\nHealth and Well-being Services\nCounseling and Mental Health Support\nEmployability and Careers Support\nStudent Union\nDisability Support Services\nSports Facilities\nFinancial Support\nLanguage Support for International Students\nAccommodation Services",
      "Accommodation": "Cardiff Metropolitan University offers a secure and supportive living environment for students on campus. There are nearly 1,000 study bedrooms available at the Cyncoed and Plas Gwyn campuses, with all utilities (electricity, gas, water, internet, insurance) included. Additionally, over 1,200 private en-suite rooms near the campuses are allocated to students through partnerships with private halls. Friendly staff are on hand to assist throughout your stay, ensuring a welcoming community​",
      "established": 1865,
      "rank": "186th",
      "location": "Llandaff Campus, Western Ave, Cardiff CF5 2YB, United Kingdom",
      "international student": 0.13,
      "country": "UK",
      "logo": "https://i.ibb.co.com/thDc8wB/11-Cardiff-Metropolitan-University.png"
    },
    {
      "Name": "City University London",
      "Overview": "City, University of London is a globally focused institution located in the heart of London. It was established in 1894 and joined the University of London in 2016. The university is known for its focus on business and the professions, offering a wide range of undergraduate, postgraduate, and research degrees.",
      "History": "The history of City, University of London highlights its significant contributions to education, beginning in 1852 with the founding of the Inns of Court School of Law, which later became part of The City Law School in 2001. Notable alumni include global leaders like Herbert Henry Asquith and Mahatma Gandhi. In 1877, St Bartholomew's College of Nursing, now part of City’s School of Health & Psychological Sciences, was established. The Northampton Institute was founded in 1894, focusing on technical education in engineering, horology, and optics. The university hosted the boxing events for the 1908 Olympics, and in 1909, it introduced the UK’s first Aeronautical Engineering courses.",
      "Ranking & Achievement": "City, University of London is dedicated to high-quality education, research, and employability. It ranks 39th in the UK for research (REF/Times Higher Education 2022) and 39th best university overall (Complete University Guide 2025). Globally, it’s in the top 350 according to QS World University Rankings 2023.\n\nCity is known for social mobility, ranking 3rd in the UK (HEPI 2023), and for career prospects, ranking 5th in London (Guardian 2024).\n\nThe university has over 20,000 students, with 70% from the UK, 7% from the EU, and 23% from other international locations. It is ranked 4th for ethnic minority inclusion and 10th for first-generation students (Times Good University Guide 2023).",
      "courses": "MSc Artificial Intelligence\nMSc Data Science\nLLM International Business Law\nMBA\nBSc (Hons) Economics\nMSc Cyber Security\nBSc (Hons) Psychology\nMSc Speech & Language Therapy\nBEng (Hons) Mechanical Engineering\nBA Journalism",
      "Department & Faculty": "Bayes Business School \nSchool of Communication & Creativity\nSchool of Policy & Global Affairs\nThe City Law School\nSchool of Health & Psychological Sciences\nSchool of Science & Technology",
      "Fee": "£15,000 to £22,000",
      "Services": "Career Development Services\nStudent Wellbeing and Mental Health Support\nLibrary Services\nIT Support Services\nSports and Fitness Facilities\nDisability Support\nLanguage Learning and Development\nInternational Student Support\nAccommodation Services\nFinancial Support and Advice",
      "Accommodation": "City offers a variety of accommodation options located within walking distance of the main campus. There are several halls of residence that cater to different student preferences, and private accommodation options are also available through partnerships. Utilities like internet, gas, and water are included in the rent.",
      "established": 1894,
      "rank": 350,
      "location": "Northampton Square, London EC1V 0HB, United Kingdom",
      "international student": 0.3,
      "country": "UK",
      "logo": "https://i.ibb.co.com/bdKG3D1/12-City-University-London.png"
    },
    {
      "Name": "Coventry University",
      "Overview": "Coventry University is dedicated to providing a high-quality education that prepares students for successful careers. With a vibrant campus and extensive student support services, it is recognized for its commitment to international students.",
      "History": "Coventry University has a rich educational heritage that dates back to the Coventry College of Design established in 1843. In 1970, it merged with Lanchester College of Technology and Rugby College of Engineering Technology, forming Lanchester Polytechnic. The name highlighted both the institution’s connection to the Midlands automotive pioneer Dr. Frederick Lanchester and its commitment to a broad range of scientific and artistic disciplines.\n\nIn 1987, the institution was renamed Coventry Polytechnic, and it gained university status in 1992 under UK Government legislation. The name \"Lanchester\" continues to be honored through the Lanchester Gallery and the Lanchester Library",
      "Ranking & Achievement": "In the latest QS World University Rankings, Coventry University has been placed 531st out of 1,503 institutions, climbing 40 places from the previous year. Additionally, it ranks 35th globally for international student appeal. The university has expanded its global reach with campuses in Coventry, London, and Scarborough, as well as a campus in Poland, a branch in Egypt, and collaborations in Morocco and China. Overall, it provides transnational education to over 21,000 students in partnership with more than 70 universities worldwide",
      "courses": "Bachelor of Arts (BA) in Business Management\nBachelor of Science (BSc) in Computer Science\nBachelor of Arts (BA) in International Relations\nBachelor of Science (BSc) in Nursing\nBachelor of Arts (BA) in Graphic Design\nBachelor of Engineering (BEng) in Mechanical Engineering\nMaster of Science (MSc) in Data Science\nBachelor of Arts (BA) in Media Production\nMaster of Arts (MA) in Education\nBachelor of Science (BSc) in Psychology",
      "Department & Faculty": "Faculty of Arts and Humanities\nFaculty of Business and Law\nFaculty of Engineering, Environment and Computing\nFaculty of Health and Life Sciences\nCoventry Business School\nSchool of Media and Performing Arts\nSchool of Psychology\nSchool of Design\nSchool of Nursing\nSchool of Architecture",
      "Fee": "£16,800 – £20,050 ",
      "Services": "Academic support\nMental health services\nCareers guidance\nInternational student support\nHousing advice\nFinancial advice\nHealth services\nStudy skills workshops\nLanguage support\nSports and fitness facilities",
      "Accommodation": "The university provides a variety of accommodation options, including traditional halls of residence, self-catered options, and en-suite rooms, all located near the Coventry campus​",
      "established": 1992,
      "rank": "531st",
      "location": "Priory St, Coventry CV1 5FB, United Kingdom",
      "international student": 0.34,
      "country": "UK",
      "logo": "https://i.ibb.co.com/ZgJVzSs/13-Coventry-University.png"
    },
    {
      "Name": "Coventry University (London Campus)",
      "Overview": "Coventry University London, established in 2010, is strategically located in the heart of London’s financial district. It is renowned as one of the largest providers of business-related degree courses in Europe, emphasizing a real business experience for its students.The university aims to prepare students for the professional world with a strong focus on employability and practical experience. It offers a variety of work-related projects, internships, and a dedicated Enterprise Hub for aspiring entrepreneurs​. With a Gold rating in the Teaching Excellence Framework, Coventry University London prioritizes high-quality teaching, supported by a team of experienced academics and industry professionals.\n",
      "History": "Coventry University London was established in 2010, strategically located in the City of London to provide a vibrant business education experience. It is recognized as one of the largest providers of business-related degree courses in Europe. The university aims to offer students a competitive edge through practical business experiences and simulations, enhancing employability and career readiness.The campus is designed to provide an industry-standard working environment, featuring technology-enabled classrooms, a simulated trading floor, and specialized facilities for fashion and design. Additionally, the university is committed to fostering entrepreneurship, supporting students in launching their own businesses through its dedicated Enterprise Hub​.\n",
      "Ranking & Achievement": "Coventry University London has made notable strides in various university rankings. In the recent QS World University Rankings: Europe 2025, the university achieved an impressive position, ranking 190th overall among 685 institutions. Additionally, it stands out in the sustainability category, climbing 90 places to 118th in Europe​.Moreover, Coventry University is recognized for its international student diversity, securing 17th place in Europe for this aspect. This reflects its appeal to a wide range of nationalities across its campuses.\n",
      "courses": "BA (Hons) Business Management and Leadership\nBA (Hons) International Business\nBSc (Hons) Accounting and Finance\nBSc (Hons) Data Science\nBSc (Hons) Marketing\nMSc Business Analytics\nMSc Digital Marketing\nMSc International Business\nMSc Project Management\nMSc Cyber Security",
      "Department & Faculty": "College of the Arts and Society\nCollege of Business and Law\nSchool of Health and Care\nCollege of Engineering, Environment and Science\nNational Institute of Teaching and Education (NITE)\nSchool of Economics, Finance and Accounting\nCoventry Law School\nSchool of Management\nSchool of Media and Performing Arts\nSchool of Life Sciences",
      "Fee": "£11,200 to £21,250",
      "Services": "Success Coaches\nHealth and Wellbeing Services\nCareers Services\nStudent Lounge\nEnterprise Hub\nDigital Services Tech Bar\nStudent Union\nAccommodation Services: \n",
      "Accommodation": "Coventry University London offers various accommodation options for students, aimed at providing a comfortable living experience in the city. The main accommodation available is Magenta House, which features modern rooms and amenities designed for student life. Here are some key details:\n\nRoom Types: Options include Bronze Ensuite rooms, Silver Ensuite rooms, Bronze Studio Plus, and Bronze Studio Premium. Prices range from approximately £379.71 to £462.41 per week for the academic year 2024-2025.\nContract Length: Contracts are typically for 51 weeks, catering to both undergraduate and postgraduate students.\nFacilities: The accommodation includes Wi-Fi, utilities, communal cleaning services, an on-site gym, and communal areas for socializing and relaxation. There are also 24/7 security features, including CCTV, ensuring a safe living environment.",
      "established": 2010,
      "rank": "190th",
      "location": "109, 117 Middlesex St, London E1 7JF, United Kingdom",
      "international student": 0.45,
      "country": "UK",
      "logo": "https://i.ibb.co.com/TcZthbT/14-Coventry-University-London-Campus.png"
    },
    {
      "Name": "De Montfort University",
      "Overview": "DMU is recognized for its emphasis on practical, hands-on education. It has a vibrant community and is well-integrated into the city of Leicester, providing students with access to various cultural and social experiences.",
      "History": "De Montfort University (DMU) in Leicester has a rich history dating back to its founding as the Leicester School of Art in 1870. Over the years, it has transformed through various names, including Leicester Polytechnic, and officially became De Montfort University on June 26, 1992. The name honors Simon de Montfort, a notable historical figure known for establishing the first parliament in 1265.\n\nDMU's heritage plays a crucial role in its identity, with many courses stemming from early training programs in areas such as art, pharmacy, engineering, and textiles. The university has continually adapted its curriculum to meet the evolving needs of industries, introducing computing courses in the 1960s that remain highly regarded today. Despite its growth, DMU is committed to providing inspirational teaching and positively impacting the community\n",
      "Ranking & Achievement": "De Montfort University (DMU) has made significant strides in the QS World University Rankings, climbing over 80 places to now rank between 711 and 720 globally, placing it in the top 50% of universities worldwide. This improvement is attributed to outstanding international research collaborations and a strong commitment to sustainability, marking DMU as one of only 20 UK institutions to see a rise in these rankings this year.\n\nThe QS rankings are based on surveys of 175,000 academic faculty and 105,000 employers, as well as the analysis of 17 million research papers. DMU has particularly excelled in sustainability measures and international research networks, reflecting its ongoing promotion of the Sustainable Development Goals (SDGs) and the expansion of its international presence, including campuses in Dubai, Kazakhstan, and Cambodia.",
      "courses": "BA (Hons) Graphic Design\nBSc (Hons) Computer Science\nBA (Hons) International Relations\nBSc (Hons) Psychology\nBA (Hons) Fashion Design\nMSc Data Analytics\nBEng (Hons) Mechanical Engineering\nBA (Hons) Business Management\nMA Creative Writing\nBSc (Hons) Nursing",
      "Department & Faculty": "Faculty of Art, Design and Humanities\nFaculty of Business and Law\nFaculty of Health and Life Sciences\nFaculty of Technology\nFaculty of Education\nFaculty of Engineering and Sustainable Development",
      "Fee": " £15,000 to £18,000 ",
      "Services": "Academic Support\nCareer Services\nStudent Accommodation Assistance\nCounseling Services\nInternational Student Support\nHealth and Wellbeing Services\nFinancial Advice\nLibrary Services\nIT Support\nSports and Recreation Facilities",
      "Accommodation": "DMU offers nearly 1,000 study bedrooms on its campuses, with all utility bills included. The university also collaborates with private halls nearby, providing additional accommodation options​",
      "established": null,
      "rank": "rank between 711 and 720 globally,",
      "location": "Gateway House, Leicester LE1 9BH, United Kingdom",
      "international student": 0.3,
      "country": "UK",
      "logo": "\"https://i.ibb.co.com/ZfZ9XhV/15-De-Montfort-University.png"
    },
    {
      "Name": "University of Hertfordshire",
      "Overview": "The University of Hertfordshire’s Heritage Hub was established in 2010. It sits under the UH Research Theme of Heritage, Cultures and Communities.\n\nUH HHub provides an organised, unified, outward-facing identity for UH heritage engagement activities. It is open to all members of staff across all Schools at the University working in the field of heritage and with outside heritage partners, and all students, especially those taking the Doctorate of Heritage (DHeritage). HHub’s activities are all participatory and involve community co-production research in heritage.",
      "History": "The University of Hertfordshire was founded in 1952 as a Technical College, established on land donated by A.S. Butler, the Chairman of the de Havilland Aircraft Company. Initially focused on mechanical and aeronautical engineering, the institution quickly expanded into a Polytechnic before achieving full university status in 1992.\n\nThe legacy of its industrial roots is evident across the de Havilland Campus, where landmarks like the historic beacon and de Havilland Goblin engine are prominent features. Today, the university celebrates its diverse community of 32,000 students from over 140 countries.\n\nRemaining committed to employability, the University of Hertfordshire offers over 550 career-focused courses aligned with industry needs, emphasizing its role as Hertfordshire's only university and its dedication to the regional skills agenda throughout its 70-year history​",
      "Ranking & Achievement": "The University of Hertfordshire was ranked best in the world for 'Console and PC – Production Excellence' at the Rookie Awards 2019, based on the quality of 3,458 student entries from 89 countries. It also achieved second place globally (first in the UK) in 'Top Visual Effects Schools,' third in 'Immersive Media – Game Design and Development for Production Excellence,' and fifth in 'Top 2D Animation Schools for Production Excellence.' Additionally, it was the best in the UK for 'Top Animation Schools' (seventh globally) and 'Top Game Design Schools' (eighth globally). These rankings highlight the university's strong focus on teamwork in creating high-quality animation films.",
      "courses": "BA (Hons) Business Administration\nBSc (Hons) Computer Science\nBA (Hons) Graphic Design\nBSc (Hons) Psychology\nBEng (Hons) Mechanical Engineering\nBA (Hons) Journalism\nMSc International Business\nMSc Data Science\nBSc (Hons) Marketing\nBSc (Hons) Architecture​",
      "Department & Faculty": "Hertfordshire Business School\nSchool of Creative Arts\nSchool of Engineering and Computer Science\nSchool of Health and Social Work\nSchool of Humanities\nSchool of Law\nSchool of Life and Medical Sciences\nHertfordshire Higher Education Consortium\nSchool of Physics, Astronomy, and Mathematics​",
      "Fee": " £14,950 and £19,950",
      "Services": "Medical Center\nStudent Wellbeing Center\nAcademic Support Services\nCareer Services\nCounseling Services\nHousing Services\nSports Facilities\nStudent Union\nLibrary Services\nTransportation Services​",
      "Accommodation": "The university guarantees on-campus accommodation for first-year students, with various options including traditional halls, flats, and studio rooms. There are also off-campus options available, providing a range of choices to suit different budgets​",
      "established": 1952,
      "rank": "62nd in the UK",
      "location": "De Havilland Campus, Mosquito Way, Hatfield AL10 9EU, UK",
      "international student": 0.135,
      "country": "UK",
      "logo": "https://i.ibb.co.com/WGXGvsS/17-University-of-Hertfordshire.png"
    },
    {
      "Name": "Northumbria University",
      "Overview": "The university is business-focused and renowned for producing career-ready graduates. Over the past decade, Northumbria has undergone significant growth, driven by its mission to offer high-quality education rooted in community and global engagement. The university has over 33,000 students from 136 countries, making it one of the most international universities in the UK.",
      "History": "Northumbria University originated as Newcastle Polytechnic in 1969, formed by merging three regional colleges: Rutherford College of Technology, the College of Art & Industrial Design, and the Municipal College of Commerce. These institutions had long been vital to the region's vocational training needs. In 1974, the Polytechnic expanded to include teacher training through the City College of Education, followed by the Northern Counties College of Education in 1976. It also introduced occupational therapy and physiotherapy training in 1976.\n\nIn 1992, the Polytechnic was awarded university status, becoming Northumbria University. Further growth occurred in 1995 with the incorporation of Bede, Newcastle, and Northumbria College of Health Studies. For a detailed history, the book Rutherford's Ladder charts Northumbria's development from its 19th-century roots to 1996​",
      "Ranking & Achievement": "Northumbria University has achieved significant success in two major rankings. It climbed to 34th place in the Complete University Guide 2025, rising more than 20 places over seven years. Additionally, it is now ranked 96th in the Times Higher Education Young University Rankings 2024, which evaluates universities under 50 years old. The university scored highly in graduate prospects and investments in facilities.\n\nThree subject areas — Forensic Science, IT, and Tourism — rank in the UK’s top five. Northumbria was also praised for its research quality and international outlook, reflecting the presence of global students and staff, as well as international research collaborations​",
      "courses": "BSc (Hons) in Computer Science\nBA (Hons) in Business and Management\nLLB (Hons) in Law\nBEng (Hons) in Electrical and Electronic Engineering\nBA (Hons) in Architecture\nBSc (Hons) in Psychology\nBA (Hons) in Graphic Design\nMSc in Data Science\nBA (Hons) in Criminology and Sociology\nMSc in International Business Management",
      "Department & Faculty": "Faculty of Arts, Design, and Social Sciences\nFaculty of Business and Law\nFaculty of Engineering and Environment\nFaculty of Health and Life Sciences",
      "Fee": "£18,250 to £19,750",
      "Services": "Students benefit from facilities like state-of-the-art laboratories, a top-rated university library, career services, academic support, and accommodation options that include on-campus halls and private accommodations nearby.",
      "Accommodation": "Northumbria offers nearly 2,000 rooms across its halls, with a range of options from en-suite rooms to shared facilities, catering for both undergraduate and postgraduate students. Prices for accommodation vary depending on the type of room and location, but all include utilities such as electricity, internet, and insurance.",
      "established": 1969,
      "rank": " 96th ",
      "location": "110-114 Middlesex Street\nLondon\nUnited Kingdom\nE1 7HT",
      "international student": 0.2,
      "country": "UK",
      "logo": "https://i.ibb.co.com/DWNpHLs/20-Northumbria-University.png"
    },
    {
      "Name": "Nottingham Trent University",
      "Overview": "Nottingham Trent University (NTU) is a modern institution located in Nottingham, England, known for its strong emphasis on employability and practical learning. It offers a diverse range of courses across various fields and has developed a reputation for excellence in teaching and research.",
      "History": "\nIn 1843, the Nottingham Government School of Design was founded to address concerns about declining British craftsmanship amid industrialization, offering training for students aged eight to 38. The school moved to the Waverley Building in 1865, one of the UK’s first purpose-built art schools. The 1881 Paris Exhibition heightened fears of cultural decline, prompting the establishment of the University College of Nottingham in the new Arkwright Building, which became a center for diverse disciplines and innovations like silicone, developed by Professor Frederick Kipping. By 1928, with support from entrepreneur Jesse Boot, the college gained financial independence and relocated to Highfields, inaugurated by King George V. In 1934, it evolved into the College of Art, a leading institution. After WWII, the Arkwright Building became the Nottingham and District Technical College, meeting the demand for skilled workers. The Nottinghamshire Farm Institute opened in 1949 to improve agricultural education, and the Technical College expanded significantly with the Newton Building in 1958, accommodating 7,000 students. In 1959, the Nottingham College of Education was established, focusing on teacher training.",
      "Ranking & Achievement": "Nottingham Trent University (NTU) has been ranked 1st in the UK for Employability in Uni Compare's 2024 rankings. The university also secured top positions for Course Quality (1st), Student Life (2nd), and was listed in the top ten for accommodation. This year, Uni Compare collected over 131,500 student ratings and reviews, highlighting lived experiences at UK universities. NTU has made significant strides, rising 18 places in Employability, four in Course Quality, and one in Student Life, moving from third to first overall in the UK rankings. Professor Edward Peck, Vice-Chancellor of NTU, emphasized that these student-voted accolades reflect the university's commitment to equipping students with essential skills and experience for their careers.",
      "courses": "Bachelor of Arts (BA) in Fashion Design\nBachelor of Science (BSc) in Environmental Science\nMaster of Science (MSc) in Data Science\nBachelor of Laws (LLB) in Law\nBachelor of Arts (BA) in Journalism\nMaster of Arts (MA) in Creative Writing\nBachelor of Arts (BA) in Graphic Design\nBachelor of Science (BSc) in Psychology\nBachelor of Education (BEd) in Primary Education\nMaster of Arts (MA) in Marketing​",
      "Department & Faculty": "School of Architecture, Design and the Built Environment\nNottingham Business School\nSchool of Arts and Humanities\nSchool of Social Sciences\nSchool of Science and Technology\nSchool of Education\nSchool of Law\nSchool of Health Sciences\nSchool of Art and Design\n",
      "Fee": "£17,500 -£24,000",
      "Services": "Academic support and tutoring\nCareer services and employability support\nMental health and wellbeing services\nInternational student support\nAccommodation services\nFinancial advice and budgeting workshops\nStudy skills workshops\nLibrary and research support\nIT services\nSports and recreational activities",
      "Accommodation": "NTU offers various accommodation options for students, with approximately 4,200 self-catering rooms available, including en-suite facilities. Options range from shared houses to studio apartments, ensuring something for different budgets and preferences. The university guarantees accommodation for international students for at least their first year",
      "established": 1843,
      "rank": "13th overall in the UK",
      "location": "50 Shakespeare St, Nottingham NG1 4FQ, UK",
      "international student": "20%,",
      "country": "UK",
      "logo": "https://i.ibb.co.com/KyCVGkw/21-Nottingham-Trent-University.png"
    },
    {
      "Name": "Portsmouth University",
      "Overview": "The University of Portsmouth is a modern, innovative institution committed to making a positive impact on society through education and research. Recognized for its high student satisfaction rates, it offers a diverse range of undergraduate and postgraduate programs across various fields, including cosmology, cyber security, and sports science. The university prides itself on fostering an inclusive environment where students receive personalized support and are encouraged to engage in research and professional practice.\n\nPortsmouth is distinguished as the UK’s only island city, providing a vibrant and picturesque backdrop for student life, featuring beaches, cultural hotspots, and a lively social scene. The university actively collaborates with local businesses and communities, aiming to enhance educational outcomes and opportunities for all students. Its strategic ambitions include expanding globally, enhancing digital learning, and addressing societal challenges through impactful research​.",
      "History": "The University of Portsmouth, established in 1908, has evolved significantly from its beginnings as a municipal college focused on chemistry and engineering. It became Portsmouth Polytechnic in 1969, gaining university status in 1992. Over the years, it has expanded its offerings, investing in facilities and research, and is recognized for its strong emphasis on teaching and community impact. Notable developments include the opening of the Dennis Sciama Building and the Future Technology Centre, enhancing its reputation in engineering and applied sciences",
      "Ranking & Achievement": "The University of Portsmouth has recently made significant strides in global rankings, positioning itself as one of the UK's top universities. In the 2024 QS World University Rankings, Portsmouth ranks 50th in the UK and 502nd globally, a remarkable improvement of over 200 places from the previous yeaAdditionally, in the Complete University Guide, Portsmouth has climbed to 47th place, jumping 22 positions from the previous year, reflecting enhanced student satisfaction and academic performance. The university aims to establish itself as the leading modern UK university and to break into the top 100 young universities worldwide by the end of the decade.\n",
      "courses": "BSc (Hons) Computing\nBSc (Hons) Psychology\nBA (Hons) Business Management\nBEng (Hons) Mechanical Engineering\nBA (Hons) Graphic Design\nBSc (Hons) Marine Biology\nBA (Hons) International Relations\nBSc (Hons) Sports Science\nBSc (Hons) Environmental Science\nBSc (Hons) Digital Media",
      "Department & Faculty": "Faculty of Business and Law\nFaculty of Creative and Cultural Industries\nFaculty of Humanities and Social Sciences\nFaculty of Science and Health\nFaculty of Technology",
      "Fee": "£18,000 to £21,500 ",
      "Services": "Student Wellbeing Service\nCareers and Employability Service \nHealth and Wellbeing Support\nLearning Support \nAccommodation Advice \nFinancial Support \nIT Support \nSupport for Care Leavers \nDisability Support \nInternational Student Support ",
      "Accommodation": "The University of Portsmouth offers a variety of accommodation options for students, including halls of residence and private rentals. Halls are centrally located, making them convenient for accessing campus facilities and the city. The university provides support in finding accommodation and has a dedicated Student Housing team to assist with the process.",
      "established": 1908,
      "rank": "502nd globally",
      "location": "Winston Churchill Ave, Southsea, Portsmouth PO1 2UP, UK",
      "international student": 0.23,
      "country": "UK",
      "logo": "https://i.ibb.co.com/r0y7211/22-Portsmouth-University.png"
    },
    {
      "Name": "Queen's University Belfast",
      "Overview": "Queen's University Belfast, established in 1845, is a leading research-intensive institution and a member of the prestigious Russell Group of universities. With over 25,000 students, including approximately 8,000 postgraduate students, it is a vibrant hub located in the heart of Belfast. The university emphasizes innovation and societal impact, contributing £1.9 billion annually to the local economy and hosting a diverse student body with 15% of international students from over 80 countries. Queen's is renowned for its research excellence, with 88% of its research rated as world-leading or internationally excellent, particularly in fields such as cancer studies, sustainability, and digital innovation​",
      "History": "Queen's University Belfast, established in 1845 as Queen's College Belfast, has evolved significantly over its 175-year history. It became an independent university in 1908 and is now recognized as one of the UK's leading institutions, ranking among the top 200 globally for impact and sustainability. Originally starting with just 195 students and 20 professors, Queen's has expanded to a vibrant community of approximately 25,000 students and 2,400 academic staff. The university's rich heritage is reflected in its iconic Lanyon building and its commitment to addressing societal challenges through education and research​. \n",
      "Ranking & Achievement": "Queen's University Belfast has recently achieved significant recognition, being ranked 26th out of 131 universities in the UK according to The Times and The Sunday Times Good University Guide 2025. This ranking highlights its status as the top university in Northern Ireland and reflects a rise of five places from the previous year. The assessment considers various factors, including student satisfaction, entry standards, research quality, and graduate prospects.",
      "courses": "BSc Accounting\nBSc Business Management\nBA English\nBSc Computer Science\nBSc International Business\nBA History\nBSc Mathematics\nBSc Psychology\nBSc Electrical and Electronic Engineering\nBSc Nursing (Mental Health)",
      "Department & Faculty": "Faculty of Arts, Humanities and Social Sciences\nFaculty of Engineering and Physical Sciences\nFaculty of Medicine, Health and Life Sciences\nQueen's Business School\nSchool of Biological Sciences\nSchool of Chemistry and Chemical Engineering\nSchool of Electronics, Electrical Engineering and Computer Science\nSchool of History, Anthropology, Philosophy and Politics\nSchool of Law\nSchool of Mathematics and Physics",
      "Fee": " £20,500\n- £25,600​",
      "Services": "Student Wellbeing Service\nDisability Service\nLibrary Services\nStudent Registry Services\nCounseling Services\nInternational Student Support\nCareers and Employability Service\nStudent Finance and Funding Advice\nAccommodation Services\nSport and Physical Activity Services",
      "Accommodation": "Queen's University Belfast offers a range of accommodation options designed to suit various preferences and budgets. Their residences include state-of-the-art rooms and apartment-style living, all located within a short distance from the main campus. Students can choose from different types of accommodations, such as single en-suite rooms, shared facilities, and studio apartments, with weekly rates starting from around £85.",
      "established": 1845,
      "rank": " 26th in the uk",
      "location": "University Rd, Belfast BT7 1NN, UK",
      "international student": 0.16,
      "country": "UK",
      "logo": "https://i.ibb.co.com/BVj1v8S/24-Queen-s-University-Belfast.png"
    },
    {
      "Name": "St Mary's University Twickenham",
      "Overview": "St Mary's University, located in Twickenham, London, is a public university that was established in 1850. Initially founded to train teachers for Catholic schools, it has evolved into a comprehensive institution offering a wide range of undergraduate and postgraduate courses.",
      "History": "St Mary's University was founded in 1850 by the Catholic Poor Schools Committee to train teachers for Catholic children. Originally located at Brook Green, Hammersmith, it was managed by the Brothers of Christian Instruction with an initial intake of six students. By 1899, the Vincentian Congregation took over its administration.\n\nDue to the growing demand for Catholic teachers, the original campus became inadequate by the 1920s. This led to the acquisition of Strawberry Hill House in Twickenham, where the college officially relocated in 1925, providing facilities for around 250 students.",
      "Ranking & Achievement": "In 2019, St Mary's University achieved a notable milestone by entering the top 100 of the Complete University Guide for the first time since it began ranking. This marked the fifth consecutive major ranking improvement for the university, following a 25-place jump in the previous year's Guardian University Guide and a rise of 22 places in both the Good University Guide and the Complete University Guide over the last two iterations.\n\nThe 2018 National Student Survey indicated a high student satisfaction rate of 88% at St Mary’s, the best among London institutions with university status and ranking in the top 20 nationally. Additionally, the Good University Guide recognized St Mary’s as the top university in London for Student Experience and Teaching Excellence.",
      "courses": "BA Primary Education with QTS\nBA Law\nBA Sports Studies\nBA Psychology\nBSc Business Management\nBSc Health and Exercise Science\nBSc Nursing\nMSc Sport Performance Analysis\nMA Creative Writing\nMSc Psychology​",
      "Department & Faculty": "Faculty of Business and Law\n\n\nFaculty of Education, Theology, and the Arts\n\n\nFaculty of Health and Sports Science\n\n\nFaculty of Human and Applied Sciences\n\n\nFaculty of Liberal and Creative Arts\n\nFaculty of Social Science\n\nFaculty of Theology and Religious Studies\n\n\nFaculty of Engineering and Technology\n\n\nFaculty of Arts and Humanities",
      "Fee": "£14,250- £16,500 ",
      "Services": "The university provides various services to support students, including academic support, career services, counseling, and health services. It also offers extensive extracurricular activities and facilities​",
      "Accommodation": "St Mary's offers a range of accommodation options, including en-suite rooms and self-catered flats. Prices vary depending on the type of accommodation chosen​",
      "established": 1850,
      "rank": "45th in the UK",
      "location": "Waldegrave Rd, Twickenham TW1 4SX, United Kingdom",
      "international student": "24%.",
      "country": "UK",
      "logo": "https://i.ibb.co.com/qsNcZKW/25-St-Mary-s-University-Twickenham.png"
    },
    {
      "Name": "Stirling University (INTO Partner)",
      "Overview": "The University of Stirling, located in Scotland, is recognized for its vibrant and supportive learning environment, boasting a diverse international community where over 30% of students come from abroad. Established in 1967, it has earned a reputation for modern research and innovative teaching across more than 170 undergraduate and postgraduate programs​. The campus is set on a scenic 330-acre estate, featuring beautiful landscapes and historic buildings, including Airthrey Castle. The university emphasizes a strong commitment to sporting excellence and offers a wide range of facilities and student support services​.\n",
      "History": "The University of Stirling, established in 1967, was the first new university in Scotland since the Second World War. Located in Stirling, Scotland, it has grown into a prestigious institution known for its strong emphasis on research and high-quality teaching across various disciplines. The university was formed on the foundation of a commitment to provide education that is impactful and accessible to all, regardless of background.\nInitially, it opened its doors to students in a temporary location before moving to its current campus, which boasts picturesque surroundings and extensive facilities. Over the years, Stirling has developed a global reputation, particularly in fields such as Communication and Media, Criminology, and Sports Science. ",
      "Ranking & Achievement": "The University of Stirling is highly regarded in global rankings, currently positioned within the top 2.5% of universities worldwide according to the QS World University Rankings. It also holds a five-star rating in the QS Stars system, reflecting excellence in various categories, including teaching quality, employability, internationalization, and research impact​. Additionally, Stirling is noted for its strong performance among younger institutions, having ranked 47th in the QS Top 50 Under 50 lis. This combination of recognition highlights its commitment to high-quality education and research, making it an attractive destination for students globally.\n\n",
      "courses": "BA (Hons) Accounting and Finance\nBSc (Hons) Aquaculture\nBSc (Hons) Biology\nBA (Hons) Business and Management\nBSc (Hons) Computer Science and Software Engineering\nBA (Hons) Criminology\nBSc (Hons) Data Science and Data Analytics\nBA (Hons) Economics\nBA (Hons) English and Literature\nBSc (Hons) Environmental Science",
      "Department & Faculty": "Faculty of Arts and Humanities\nFaculty of Health Sciences and Sport\nFaculty of Natural Sciences\nFaculty of Social Sciences\nStirling Management School",
      "Fee": "£18,200 to £25,600 ",
      "Services": "Student Support Services\nCareers Service\nStudent Learning Services\nAccommodation Services\nMental Health and Wellbeing Support\nInternational Student Support\nFinancial Advice and Support\nDisability Services\nStudy Abroad and Exchange Programs\nAcademic Registry Services",
      "Accommodation": "The University of Stirling offers a wide variety of accommodation options to suit diverse student needs. With over 2,500 bedrooms across 19 properties, students can choose between standard rooms, ensuite rooms, and studio flats. All accommodations are self-catering, and facilities include shared kitchens and communal areas.",
      "established": 1967,
      "rank": "730th in the world",
      "location": "Stirling FK9 4LA, UK",
      "international student": 0.3,
      "country": "UK",
      "logo": "https://i.ibb.co.com/7JWN8P0/26-Stirling-University.png"
    },
    {
      "Name": "University College Birmingham",
      "Overview": "University College Birmingham (UCB) is known for its strong focus on vocational education and offers a diverse range of undergraduate and postgraduate courses, particularly in areas like business, health, and culinary arts. UCB prides itself on providing practical experiences through work placements and industry partnerships, preparing students for successful careers.\n\nLocated in the vibrant city of Birmingham, UCB boasts modern facilities backed by a significant investment, enhancing the learning experience. The university supports over 3,100 international students from more than 70 countries, offering tailored services such as visa assistance, academic support, and English language courses.",
      "History": "University College Birmingham (UCB) has a rich history that dates back to its founding in 1957 as a college specializing in catering and hospitality training. Over the years, UCB has expanded its offerings and evolved into a respected higher education institution, focusing on vocational courses across various sectors, including business, health, and creative industries.\n\nIn 2012, UCB gained university status, which marked a significant milestone in its development, allowing it to confer degrees and provide a wider range of academic programs. Today, UCB serves over 10,000 students from around 90 countries and is well-known for its strong links with industry, offering career-focused education that emphasizes practical skills and employability​.",
      "Ranking & Achievement": "University College Birmingham has received notable recognition in various rankings and surveys. It was ranked first out of 101 higher education institutions for postgraduate student support and resources in the Postgraduate Taught Experience Survey (PTES)​. Additionally, the university achieved a commendable position in overall student satisfaction, placing fourth in the same survey. In terms of broader rankings, it is noted that University College Birmingham has been recognized for its exceptional student support services and has won regional awards for both postgraduate and international student experiences​ . Furthermore, the university has made strides in improving its facilities and enhancing the quality of education offered, aiming to maintain high satisfaction rates among students.\n",
      "courses": "BSc (Hons) Accounting and Finance\nBSc (Hons) Business Management\nBSc (Hons) Cyber Security\nBA (Hons) Digital Marketing\nBSc (Hons) Health and Social Care\nBSc (Hons) International Hospitality Management\nBSc (Hons) Sport and Exercise Science\nBSc (Hons) Tourism Management\nBA (Hons) Events Management\nBSc (Hons) Culinary Arts Management",
      "Department & Faculty": "Business School\nSchool of Engineering, Digital and Sustainable Construction\nSchool of Health and Food\nSchool of Psychology, Sport and Education",
      "Fee": "£14,400 to £15,750.",
      "Services": "Mental Health and Wellbeing Service\nDisability and Neurodiversity Support\nHealth and Wellbeing Service\nFinancial Support\nAcademic Skills and English Support\nCareers, Employability, and Placement Support (Hired)\nLearning Support\nSafeguarding Services\nStudent Engagement Activities\nAccommodation Services",
      "Accommodation": "\n\n\n\nAt University College Birmingham, students are guaranteed a place in accommodation for their first year, provided they apply in a timely manner. The primary accommodation option is The Maltings, which offers fully furnished rooms with amenities like free WiFi, a fitted wardrobe, and access to communal kitchens. The weekly rent for the 2024/25 academic year is £130 for standard rooms and £153 for en suite options, covering a 42-week contract from September to June, which saves students from being charged during holiday periods.",
      "established": 1957,
      "rank": "no rank",
      "location": "Summer Row, Birmingham B3 1JB, United Kingdom",
      "international student": 0.26,
      "country": "UK",
      "logo": "https://i.ibb.co.com/whW7PpQ/29-University-College-Birmingham.png"
    },
    {
      "Name": "University of Law",
      "Overview": "The University of Law (ULaw) is a specialist institution focused on delivering high-quality legal and business education. It is known for its practical approach to teaching, aiming to equip students with real-world skills needed for professional success. ULaw offers a variety of undergraduate and postgraduate programs across fields such as law, business, criminology, and psychology, with flexible study options, including online learning. It is recognized for its strong employability focus, with 94% of postgraduates employed or in further study within 15 months of graduating. The university operates multiple campuses across the UK, with additional locations in Hong Kong and Germany​.",
      "History": "The University of Law (ULaw) traces its origins back to \n1876 with the founding of the tutorial firm Gibson & Weldon. \nIt has since grown to become the largest provider of legal \neducation in the UK. Over the years, ULaw has expanded \nits offerings and achieved university status in 2012. In addition\n to its law programs, it launched a business school in 2016. \nThe institution is known for its innovative and practical teaching \nmethods, which prepare students for real-world challenges \nin the legal and business sectors\n",
      "Ranking & Achievement": "The University of Law (ULaw) has consistently achieved high rankings for its teaching and employability outcomes. In the 2024 National Student Survey (NSS), it ranked in the top 10 in the UK for teaching quality. ULaw has also been awarded a prestigious 5-star rating from QS for various aspects, including teaching, employability, and inclusiveness. Additionally, ULaw holds a Silver overall rating in the 2023 Teaching Excellence Framework (TEF), with a Gold rating for student experience, highlighting its commitment to providing outstanding education .",
      "courses": "LLB (Hons) Law\nBSc (Hons) Business Management\nBSc (Hons) Criminology\nBSc (Hons) Professional Policing\nBSc (Hons) Psychology\nBSc (Hons) Computer Science\nLLM Legal Practice (SQE1&2)\nBar Practice Course (BPC)\nPostgraduate Diploma in Law (PGDL) - Conversion\nMaster of Business Administration (MBA)",
      "Department & Faculty": null,
      "Fee": "£17,000 and £18,950",
      "Services": "Student Support\nWellbeing Support\nInternational Student Support\nCareer Services\nGraduation Services\nCost of Living Advice\nOpen Days and Events\nStudent Life Activities\nContinuing Your Studies Guidance\nPro Bono Services",
      "Accommodation": "The University of Law does not have its own on-campus accommodation but works with local providers in the cities where its campuses are located. They provide assistance to students in finding suitable housing through an online portal called Studentpad, which lists available properties for rent near each campus. Once you’ve accepted your place at the university, their accommodation team can guide you in locating options that fit your needs. For support, students can also join campus-specific Facebook groups to connect with other students looking for housemates​. ",
      "established": 1962,
      "rank": "7th position",
      "location": "London - The University of Law has a campus in Bloomsbury, as well as in Moorgate and the City of London.\nBirmingham - Located in the heart of the city.\nLeeds - Situated in the city center.\nManchester - Located near the city center.\nBristol - Found in the city center.\nGuildford - Situated in Surrey.",
      "international student": "no persentage",
      "country": "UK",
      "logo": "https://i.ibb.co.com/VwMj3Lw/30-University-of-Law.png"
    },
    {
      "Name": "University of South Wales",
      "Overview": "The University of South Wales (USW) is a prominent institution in Wales, known for its commitment to delivering quality education and research. The South Wales Campus serves as a hub for various academic programs and activities.",
      "History": "The University of South Wales has its origins in the Newport Mechanics' Institute, founded in 1841. This institution later evolved into the University of Wales, Newport. In 1913, the South Wales and Monmouthshire School of Mines was established, which eventually became the Polytechnic of Wales. The institution gained university status as the University of Glamorgan in 1992.\n\nIn 2012, following a consultation process, the university was rebranded as the University of South Wales. More recently, in 2020, USW formed a strategic alliance with the University of Wales Trinity Saint David. This collaboration aims to enhance innovation and support economic regeneration in Wales while allowing both institutions to maintain their distinct identities​",
      "Ranking & Achievement": "The University of South Wales (USW) has made impressive strides in recent rankings, climbing 21 places to be ranked third in Wales. Notably, USW improved by 41 places to 33rd in student satisfaction with teaching, and by 13 places to 19th for the quality of feedback and assessment from academic staff. Additionally, the university saw a 17-place rise regarding the percentage of graduates in employment or further study within 15 months of graduation​(\nMastersBuddy\n)​(\nSIUK\n).\n\nUSW excels in several subjects, with aerospace engineering, animation, forensic science, general nursing, and marketing leading in Wales. The university offers nine subjects ranked within the UK's top 25, including health professions, which is ranked fifth nationally, and law, which climbed 31 places to 19th. Notably, aerospace engineering ranks first in the UK for teaching and assessment​",
      "courses": "Aeronautical Engineering (BEng Hons)\nAerospace Engineering (MEng) \nForensic Science (BSc Hons) \nHealth Professions (BSc Hons) \nMidwifery (BSc Hons)\nNursing (BSc Hons) \nPsychology (BSc Hons) \nBusiness Management (BA Hons)\nMarketing (BA Hons)\nCreative Writing (BA Hons)",
      "Department & Faculty": "Faculty of Business and Creative Industries\nFaculty of Computing, Engineering and Science\nFaculty of Life Sciences and Education\nFaculty of Health and Care\nFaculty of Social Sciences\nFaculty of Arts and Design\nFaculty of Law\nFaculty of Engineering\nFaculty of Psychology\nFaculty of Sports Science",
      "Fee": "£15,000 and £16,500 ",
      "Services": "Disability Service \nMental Health & Counselling Services \nHealth Service\nProgression Advice Team \n\nReport and Support\n\nStudent Money Advice Team\nChaplaincy \n\nCareers Service\n\nInternational Support \n\nLibrary Services ",
      "Accommodation": "The University of South Wales offers a variety of accommodation options designed to cater to different needs and budgets. Students can choose from university-managed residences, private halls, or shared housing. Facilities typically include furnished rooms, communal areas, and access to essential amenities. The university prioritizes a supportive community atmosphere, with dedicated staff available to assist residents. Most accommodations are conveniently located near campuses, making it easier for students to attend classes and participate in university life.",
      "established": 2013,
      "rank": null,
      "location": null,
      "international student": 0.12,
      "country": "UK",
      "logo": "https://i.ibb.co.com/wwqQD2L/31-University-of-South-Wales.png"
    },
    {
      "Name": "University of Wolverhampton",
      "Overview": "The University of Wolverhampton has a rich history that traces back to 1827, originating from the Mechanics Institute movement aimed at providing education to working men. Initially offering vocational and general education, the institution evolved into a technical college and then a university.",
      "History": "The University of Wolverhampton has a rich history that began with the founding of the Newport Mechanics' Institute in 1841. This foundation laid the groundwork for what would eventually become the university, which officially achieved university status in 1992.\n\nOver the years, the institution has expanded significantly, starting with the establishment of the Wolverhampton and Staffordshire Technical College in 1933, which aimed to make higher education accessible to all, including underprivileged students. The college adopted a progressive ethos, allowing women to study in fields traditionally dominated by men.\n\nThe university has continuously adapted to the needs of students and industries. Notable developments include the introduction of degree programs in the 1960s and the designation as a polytechnic in 1969, which further expanded its academic offerings. The university has also fostered international partnerships and welcomed students from diverse backgrounds.\n\nToday, the University of Wolverhampton boasts three campuses, offers over 70 courses, and has invested significantly in its facilities to enhance the student experience",
      "Ranking & Achievement": "Overall Ranking: 72nd in the UK according to the Complete University Guide 2024.\nSubject Rankings: Specific subjects such as Engineering and Computer Science are highly rated, with improvements noted in student satisfaction and teaching quality​",
      "courses": "BA (Hons) Business Management\nBSc (Hons) Computer Science\nBA (Hons) Law\nBSc (Hons) Nursing\nBSc (Hons) Midwifery\nBSc (Hons) Psychology\nBSc (Hons) Aerospace Engineering\nBEng (Hons) Civil Engineering\nBA (Hons) Graphic Design\nBSc (Hons) Sports Coaching",
      "Department & Faculty": "Faculty of Arts\nFaculty of Education, Health and Wellbeing \nFaculty of Engineering, Science and the Built Environment \nFaculty of Social Sciences \nFaculty of Business \nFaculty of Law\nFaculty of Health and Wellbeing \nFaculty of Digital and Creative Industries \nFaculty of Sport \nFaculty of Lifelong Learning ",
      "Fee": "£14,950-£16,950",
      "Services": "Student Support and Wellbeing \nCareers Enterprise and The Workplace \nAccommodation Services \nIT Services \nLibrary Services \nAcademic Support \nInternational Student Support \nSports and Fitness \nFinancial Support ",
      "Accommodation": "The University of Wolverhampton offers a variety of accommodation options designed to suit different student needs and budgets. Students can choose from standard and en-suite rooms across campuses in Wolverhampton, Walsall, and Telford. All accommodations are fully furnished and include utility bills, internet access, and basic contents insurance.",
      "established": 1827,
      "rank": "72nd in the UK",
      "location": "Wulfruna St, Wolverhampton WV1 1LY, UK",
      "international student": 0.27,
      "country": "UK",
      "logo": "https://i.ibb.co.com/NxFjNCP/32-University-of-Wolverhampton.png"
    },
    {
      "Name": "University of the West of England",
      "Overview": "The University of the West of England (UWE Bristol) is a dynamic and ambitious institution dedicated to addressing future global challenges through high-quality education, impactful research, and a culture of innovation. Located in Bristol, UWE offers a diverse range of undergraduate and postgraduate programs designed to equip students with the skills needed for success in the modern world. The university prides itself on its strong emphasis on employability, with 90% of graduates either in work or further study within 15 months of graduation. UWE Bristol also boasts a £300 million investment in state-of-the-art facilities, enhancing the student experience and supporting cutting-edge research​",
      "History": "The University of the West of England (UWE) has a rich history that dates back to the founding of the Bristol Society of Merchant Venturers' Navigation School in 1595. Over the years, this institution evolved significantly, becoming the Merchant Venturers' Technical College in 1894. The college later split into the Bristol College of Commerce and the Bristol College of Technology in 1949.\n\nIn the 1960s, the College of Technology was divided further, leading to the establishment of the Bristol College of Science and Technology, which achieved university status in 1965. By 1970, Bristol Polytechnic was formed with multiple campuses, including Frenchay, which officially opened in 1975 after extensive development.\n\nIn 1989, the Education Reform Act transitioned polytechnics to independent Higher Education Corporations. UWE finally gained university status in 1992, reflecting its growth and commitment to higher education in the region. The university continues to expand its offerings, including partnerships with local colleges and the development of specialized facilities.",
      "Ranking & Achievement": "The University of the West of England (UWE Bristol) has made notable progress in various university rankings. In the 2023 Guardian University Guide, UWE climbed 12 places to rank 24th overall in the UK, becoming the 4th in the South West region.\n\nIn subject-level rankings, UWE has excelled, with 10 programs listed among the top 10 nationally. These include:\n\nInterior Design - 2nd\nAnimation & Game Design - 2nd\nProduct Design - 6th\nConstruction, Surveying & Planning - 6th\nFilm Production and Photography - 6th\nArchitecture - 7th\nParamedic Science - 7th\nAerospace Engineering - 7th\nPhilosophy - 7th\nCreative Writing - 9th\n",
      "courses": "Business and Management - BA(Hons)\nCivil Engineering - BEng(Hons)\nComputer Science - BSc(Hons)\nCreative Music Technology - BSc(Hons)\nCriminology - BA(Hons)\nDigital Media - BSc(Hons)\nEarly Childhood Studies - BA(Hons)\nForensic Science - BSc(Hons)\nMarketing - BA(Hons)\nNursing (Adult) - BSc(Hons)",
      "Department & Faculty": "Faculty of Arts, Creative Industries and Education\nFaculty of Business and Law\nFaculty of Environment and Technology\nFaculty of Health and Applied Sciences\nFaculty of Engineering and the Environment\nFaculty of Social Sciences\nBristol Business School\nBristol Law School\nBristol School of Art and Design\nBristol School of Health and Social Care",
      "Fee": " £14,000 to £16,500",
      "Services": "Student Support Services\nCareer Services \nCounseling and Mental Health Services \nLibrary Services \nInternational Student Support \nDisability Support Services \nAccommodation Services \nHealth Services \nFinancial Support Services \nIT Support Services ",
      "Accommodation": "At the University of the West of England (UWE), accommodation is designed to create a vibrant community while providing convenient living arrangements for students. Located across three campuses—Frenchay, Glenside, and Bower Ashton—UWE offers a variety of housing options that cater to different needs and preferences.\n\nFrenchay Campus features several types of accommodations, including the Student Village, Wallscourt Park, and the newly built Purdown View flats. These options include en-suite rooms and shared facilities, and they are located close to essential amenities such as the library, sports center, and various cafes and restaurants",
      "established": 1992,
      "rank": " 24th overall in the UK",
      "location": "Coldharbour Ln, Stoke Gifford, Bristol BS16 1QY, UK",
      "international student": 0.25,
      "country": "UK",
      "logo": "https://i.ibb.co.com/0sSwJQ5/33-University-of-the-West-of-England.png"
    },
    {
      "Name": "Abertay University",
      "Overview": "Abertay University, located in the heart of Dundee, Scotland, is a modern institution home to around 4,000 students. The university emphasizes innovation and industry partnerships, offering a diverse range of undergraduate and postgraduate courses tailored to meet the demands of today's job market. With a strong focus on quality teaching and student satisfaction, Abertay has been recognized for its supportive community, providing personalized support including mentoring and academic advice. The university has also gained accolades for its research intensity and teaching quality, ranking highly among modern universities in the UK​",
      "History": "Abertay University, located in Dundee, Scotland, was founded in 1888 as the Dundee Technical Institute. Initially focused on providing industrial education in fields such as engineering, mechanics, and textiles, it expanded to include subjects like business and computing as industry needs evolved. Achieving university status in 1992, it was renamed Abertay University in 1994.\n\nKnown for pioneering technological education, Abertay introduced the world's first degree in computer games in 1998 and an ethical hacking program in 2006. It continues to innovate in areas such as environmental science and cybersecurity, maintaining its strong industry connections and practical approach to education.",
      "Ranking & Achievement": "Abertay University is recognized for its strong emphasis on teaching quality and student satisfaction. It consistently ranks highly in both national and subject-specific rankings:\n\nTeaching Quality: Abertay is ranked within the top 20 UK universities for teaching quality by The Times & Sunday Times Good University Guide. It has been previously awarded the title of University of the Year for Teaching Quality in 2021​.\n\n\nGuardian University Guide: Abertay ranks in the top 25 for teaching and course satisfaction, with several programs, such as Nutrition and Food Science, Computer Science, and Civil Engineering, ranking in the top 5 or 10 for their respective categories across the UK.​\n\n",
      "courses": "BSc (Hons) Computer Science\nBA (Hons) Accounting and Finance\nBSc (Hons) Ethical Hacking\nBSc (Hons) Civil Engineering\nLLB (Hons) Law\nBA (Hons) Business Management\nBA (Hons) Game Design and Production\nBSc (Hons) Cybersecurity\nBA (Hons) Psychology\nBSc (Hons) Biomedical Science",
      "Department & Faculty": "Department of Built Environment and Life Sciences\nDepartment of Health, Sport, and Wellbeing\nDepartment of Sociological and Psychological Sciences",
      "Fee": "£15,500 to £18,000,",
      "Services": "Counselling and Mental Health Support \nDisability Support \nCareer Services\nInternational Student Support \nStudy Support\nHealth Services \nAccommodation Services\nFinancial Advice \nIT and Digital Services \nStudent Enquiry Zone ",
      "Accommodation": "Abertay University offers accommodation options through partnerships with private student halls, specifically Parker House and Lyon Street Terrace. These are both located within a short walking distance from the university campus, with Parker House about 10 minutes away and Lyon Street Terrace around 15 minutes.",
      "established": 1994,
      "rank": "the UK ranking is 114",
      "location": "Bell St, Dundee DD1 1HG, UK",
      "international student": 0.25,
      "country": "UK",
      "logo": "https://i.ibb.co.com/v4W8fHM/34-Abertay-University.png"
    },
    {
      "Name": "University of Edinburgh",
      "Overview": "The University of Edinburgh, one of the leading universities globally, offers a vibrant and diverse educational environment in the heart of Scotland’s capital. Founded in 1582, it is known for its rich history, exceptional research, and commitment to excellence in teaching. The university emphasizes interdisciplinary collaboration across various fields, preparing students for successful futures through a stimulating learning atmosphere. With a strong focus on innovation and global engagement, Edinburgh attracts students and staff from around the world, fostering a multicultural community that enhances the educational experience",
      "History": "The University of Edinburgh, established in 1582, is one of the oldest universities in Scotland, founded under a Royal Charter from King James VI. Initially known as Tounis College, it began with classes held at Hamilton House. Over the centuries, it became a hub for the European Enlightenment, with significant developments in various fields such as law, medicine, and humanities. The university underwent several transformations, including the establishment of new faculties and the integration of institutions, ultimately leading to its current structure of colleges and schools. Notable milestones include the foundation of the Faculty of Law in 1707, the introduction of the Medical Faculty in 1726, and various mergers with institutions like the Royal (Dick) Veterinary College and Moray House Institute of Education.",
      "Ranking & Achievement": "The University of Edinburgh is consistently recognized as one of the world's leading universities. As of 2025, it holds the 27th position in the QS World University Rankings and ranks 4th in the UK for research power according to the 2021 Research Excellence Framework. The university's strong performance is reflected across various rankings, including its notable presence in the Shanghai Ranking, where it has been positioned among the top 40 globally.",
      "courses": "Accounting (BAcc)\nBiological Sciences (BSc)\nBusiness (MA)\nComputer Science (BSc)\nEconomics (BSc)\nLaw (LLB)\nMathematics (BSc)\nMedicine (MBChB)\nPhilosophy (MA)\nVeterinary Medicine (BVMS)",
      "Department & Faculty": "College of Arts, Humanities & Social Sciences\n\nCollege of Science & Engineering\n\nCollege of Medicine & Veterinary Medicine",
      "Fee": " £24,500 to £40,200 ",
      "Services": "Academic Services\nFinancial Support\nCareers Service\nCounselling Service (Student)\nDisability and Learning Support Service\nAccommodation Services\nHealth Service\nEdinburgh Global\nStudent Support Services",
      "Accommodation": "The University of Edinburgh offers a range of accommodation options for students, ensuring a supportive living environment. They guarantee accommodation for all eligible undergraduate students from outside Edinburgh who apply by the deadline. Options include catered and self-catered residences located near key university facilities, with utilities, internet, and contents insurance typically included in the rent.",
      "established": 1583,
      "rank": "27th ",
      "location": "Old College, South Bridge, Edinburgh EH8 9YL, UK",
      "international student": 0.3,
      "country": "UK",
      "logo": "https://i.ibb.co.com/FzkbJq8/35-University-of-Edinburgh.png"
    },
    {
      "Name": "University of Chester",
      "Overview": "The University of Chester, founded in 1839, is known for its commitment to student support and engagement. Located in the historic city of Chester, it offers a range of undergraduate and postgraduate programs across various fields. The university emphasizes a modern learning environment, combined with a rich history, and has received accolades for its teaching quality and student satisfaction. It aims to provide a vibrant campus experience and supports international students through various initiatives​",
      "History": "The University of Chester traces its origins back to 1839 when it was established as the Chester Diocesan Training College, focused on training teachers. This initiative was driven by Bishop John Bird Sumner's vision to address the educational needs during the Industrial Revolution. Over the years, the college evolved, admitting female students in 1963 and expanding its curriculum to include various subjects beyond education.\n\nIn the mid-20th century, the institution transitioned to Chester College and later became Chester College of Education, reflecting its broader educational role. It began offering degree courses in collaboration with the University of Liverpool during the 1960s and 1970s. The college gained university college status in 1996 and officially became the University of Chester in 2005, marking a significant milestone in its development.\n\nToday, the University of Chester is known for its diverse academic offerings and has expanded its campuses to include locations in Warrington and Shrewsbury. The institution emphasizes employability and global engagement, providing a supportive learning environment for a vibrant student community",
      "Ranking & Achievement": "The University of Chester has made significant strides in university rankings recently. In the WhatUni? Student Choice Awards 2024, it was named the 2nd University of the Year and ranked 1st for International Students. Additionally, it achieved the 1st place in the category for Postgraduate Study and was noted for having over 50% of its research rated as world-leading or internationally excellent according to the Research Excellence Framework (REF) 2021",
      "courses": "Accounting (with Placement Year) BSc (Hons)\nAdult Nursing BN (Hons)\nActing BA (Hons)\nBusiness Management BSc (Hons)\nComputer Science BSc (Hons)\nEducation Studies BA (Hons)\nPsychology BSc (Hons)\nSociology BA (Hons)\nMedia Production BA (Hons)\nSports Studies BA (Hons)",
      "Department & Faculty": "Faculty of Arts, Humanities and Social Sciences\nFaculty of Health, Medicine and Society\nFaculty of Science, Business and Enterprise",
      "Fee": "£13,950",
      "Services": "Student Support Services \nDisability and Inclusion Support \nMental Health Support\nLearning and Information Services (LIS) \nCareer Services\nFinancial Support Services\nInternational Student Support \nAccommodation Services \nCounselling Services\nWellbeing Services ",
      "Accommodation": "The University of Chester provides a variety of guaranteed and secure accommodation options for students, including on-campus and nearby residences. Students can enjoy full board, self-catered options, or private housing partnerships, ensuring a convenient living experience. The accommodation is designed to help students settle in comfortably, with support available from the Residential Life Team. Conveniently located, it allows easy access to university facilities and Chester's vibrant city life​",
      "established": 1839,
      "rank": null,
      "location": "Parkgate Rd, Chester CH1 4BJ, United Kingdom",
      "international student": 0.27,
      "country": "UK",
      "logo": "https://i.ibb.co.com/1f3B3rf/36-University-of-Chester.png"
    },
    {
      "Name": "Manchester Metropolitan University ",
      "Overview": "Manchester Metropolitan University (MMU) is located in the vibrant city of Manchester, known for its rich cultural heritage and strong sense of community. Established in 1970, MMU has evolved into a modern university that emphasizes creativity, innovation, and employability. The institution is committed to providing a high-quality education and has been recognized with a Gold rating in the Teaching Excellence Framework (TEF)​. With a diverse student body of over 38,000, MMU offers a wide range of undergraduate and postgraduate courses across various disciplines, including arts, business, health, and science. The university prides itself on its strong links with local and global industries, providing students with practical experiences and networking opportunities that enhance their career prospects​\n\n\n",
      "History": "Manchester Metropolitan University (MMU) boasts a rich history spanning 200 years, rooted in its inception in 1824 as the Manchester Mechanics' Institute. This foundation aimed to provide education and vocational training, responding to the needs of an industrializing society. Over the decades, it evolved into a prominent educational institution, formally becoming a university in 1992.\n\nAs it approaches its bicentennial in 2024, MMU emphasizes its commitment to driving innovation and addressing global challenges through research and education. Key areas of focus include sustainability, economic growth, and healthcare transformation. The university has developed a strong reputation for its creative programs and community engagement, fostering a diverse learning environment that prepares students for future challenges",
      "Ranking & Achievement": "Manchester Metropolitan University (MMU) has made notable strides in various rankings. In the latest Times Higher Education Impact Rankings 2024, the university has jumped 22 places, now ranking 37th globally for its commitment to the United Nations Sustainable Development Goals (SDGs).This demonstrates MMU's focus on sustainability and societal impact.Furthermore, MMU's Manchester School of Architecture is highly regarded, ranked 5th in the world. These rankings reflect the university's commitment to providing high-quality education and its positive influence on both local and global communities.\n\n",
      "courses": "BSc (Hons) Accounting and Finance\nBA (Hons) Business Management\nBA (Hons) Marketing\nBSc (Hons) Computer Science\nBA (Hons) Graphic Design\nBSc (Hons) Sports Science\nBSc (Hons) Psychology\nBEng (Hons) Mechanical Engineering\nBSc (Hons) Data Science\nBA (Hons) International Relations",
      "Department & Faculty": "Faculty of Business and Law\nFaculty of Arts and Humanities\nFaculty of Health and Education\nFaculty of Science and Engineering",
      "Fee": "£18,500 to £25,000",
      "Services": "Counseling and Mental Health Support\nDisability Support Services\nAcademic Support\nCareer Services\nFinancial Support\nLibrary Services\n",
      "Accommodation": "Manchester Metropolitan University (MMU) offers a range of accommodation options designed to cater to diverse student needs. The university provides residential halls that are conveniently located near the city center, ensuring easy access to campus facilities and local amenities.",
      "established": 1992,
      "rank": " 37th",
      "location": "Ormond, Lower Ormond St, Manchester M15 6BX, UK",
      "international student": 0.35,
      "country": "UK",
      "logo": "https://i.ibb.co.com/dmkdss4/41-Manchester-Metropolitan-University.png"
    },
    {
      "Name": "University of Solent",
      "Overview": "Solent University, located in the vibrant city of Southampton, offers a diverse and inclusive environment for students from all backgrounds. The university is known for its strong emphasis on practical learning, with award-winning teaching and robust industry links designed to equip graduates with the skills that employers value. With a wide range of courses, students benefit from interdisciplinary learning and comprehensive support services throughout their academic journey. The campus is centrally located, providing easy access to various amenities and a lively social scene​.",
      "History": "Solent University, established as a university in 2005, has roots that trace back to a private School of Art founded in 1855. Over the years, the institution grew through the merging of several colleges, including Southampton College of Art, the College of Technology, and the College of Nautical Studies at Warsash. Since gaining university status, Solent has focused on providing practical education, enabling students to turn their skills and knowledge into meaningful careers. The university is dedicated to fostering social and economic growth within the communities it serves​",
      "Ranking & Achievement": "Solent University has seen significant improvements in various university rankings. In the Complete University Guide 2025, Solent ranks 102nd out of 130 UK institutions and has excelled in several subject areas, such as Architecture, which is ranked 1st for student satisfaction and 7th for graduate prospects. The Guardian University Guide 2025 also places Solent’s Law program 5th nationally, highlighting its strong graduate outcomes.",
      "courses": "BSc (Hons) Accountancy and Finance\nBA (Hons) Acting and Performance\nMSc Applied AI and Data Science\nBSc (Hons) Adult Nursing Practice\nBA (Hons) Animation\nMA Acting for Screen\nBSc (Hons) Biomedical Science\nBSc (Hons) Business Management\nBSc (Hons) Construction Management\nBA (Hons) Film and Television",
      "Department & Faculty": "Department of Art and Music\nDepartment of Business and Law\nIncludes Solent Business School and Solent Law School\nDepartment of Social Sciences and Nursing\nDepartment of Science and Engineering\nDepartment of Film and Media",
      "Fee": "£13,500 to £16,000",
      "Services": "Student Hub\nStudent funding team\nStudy skills\nCounselling services\nCareers and employability\nInternational student support\nDisability support\nSafer Solent\nSupport for entrepreneurs\nAccommodation services",
      "Accommodation": "Solent University offers a variety of student accommodation options, all located within a 20-minute walk from the campus. These accommodations provide amenities such as up to 100mb WiFi, social rooms, and 24-hour support. Utilities and cleaning of communal areas are included in the rent, along with personal contents insurance. Specialized options like quieter areas, same-sex accommodation, and spaces for postgraduate and maritime officer cadets are available. For those interested in private housing, the university offers advice on navigating local rentals​",
      "established": 2005,
      "rank": " 102nd in uk",
      "location": "E Park Terrace, Southampton SO14 0YN, United Kingdom",
      "international student": 0.15,
      "country": "UK",
      "logo": "https://i.ibb.co.com/HXvjgSn/38-University-of-Solent.png"
    },
    {
      "Name": "Robert Gordon University",
      "Overview": "Robert Gordon University (RGU) is a dynamic and inclusive institution located in Aberdeen, Scotland, known for its strong emphasis on industry-led education and research. Established in 1992, RGU has a rich history spanning over 250 years and offers more than 300 undergraduate and postgraduate courses across diverse fields, including engineering, architecture, life sciences, and creative industries.\n\nThe university prioritizes a high-quality student experience, reflected in its ranking as one of the top institutions in Scotland for student satisfaction. With a student body exceeding 16,500, RGU is also a leading provider of online learning in the UK, collaborating closely with employers to ensure its curriculum meets current and future workforce demands. RGU is committed to impactful research, particularly in areas such as sustainable transport and artificial intelligence, contributing to both regional and national development efforts​",
      "History": "Robert Gordon University (RGU) has a rich history that dates back to the 17th century, rooted in the vision of Aberdeen merchant Robert Gordon. Born in 1668, he founded Robert Gordon's Hospital in 1729 to provide education for underprivileged children. Over the years, the institution evolved, transforming into Robert Gordon's College in 1881 and later into a technical college in the 20th century. In 1992, it was granted university status, marking its transition into a modern educational institution dedicated to providing high-quality vocational education and research. Today, RGU is recognized for its commitment to employability, student satisfaction, and innovative research across various fields",
      "Ranking & Achievement": "Robert Gordon University (RGU) has established a strong reputation in the UK, particularly for student satisfaction and teaching quality. In the latest rankings from the Complete University Guide, RGU is recognized as one of the top three institutions in Scotland and among the top ten in the UK for overall student satisfaction. Additionally, it was noted for significant improvements in various subject areas, with Physiotherapy ranked first in Scotland and third in the UK.\n\nRGU also shines in the Times and Sunday Times Good University Guide, where it was ranked second in Scotland for teaching quality and placed in the top 20 nationally for student experience. The university has been commended for its student-centered approach, which enhances both the learning experience and graduate prospects.",
      "courses": "Accounting and Finance (BA Hons)\nBusiness Management (BA Hons)\nCyber Security and Network Management (BSc Hons)\nData Science with Artificial Intelligence (BSc Hons)\nFashion Management (BA Hons)\nInternational Business Management (BA Hons)\nNursing (BSc Hons)\nParamedic Practice (BSc Hons)\nEvents Management (BA Hons)\nArchitecture (BSc Hons)",
      "Department & Faculty": "Faculty of Design and Technology\nFaculty of Health and Social Care\nFaculty of Business\nFaculty of Engineering\nFaculty of Arts\nFaculty of Computing\nFaculty of Life Sciences\nScott Sutherland School of Architecture and Built Environment\nGray's School of Art\nSchool of Pharmacy and Life Sciences",
      "Fee": "£15,600 to £19,500",
      "Services": "Counselling and Wellbeing \nMedical Services \nCareers Support \nThe Inclusion Centre\nStudent Advice \nStudent Life Hub \nLibrary Services \nAccommodation Services \nInternational Student Support ",
      "Accommodation": "Robert Gordon University (RGU) offers a variety of accommodation options for students, primarily self-catering, spread across four sites in Aberdeen. The university prioritizes creating a safe and supportive living environment to enhance student life. Staying in RGU accommodation fosters a sense of community among students, as they can easily connect with peers in a shared living space.",
      "established": 1992,
      "rank": "between 801 and 1000 in the Times Higher Education World University Rankings 2024​",
      "location": "Garthdee House, Garthdee Rd, Garthdee, Aberdeen AB10 7AQ, UK",
      "international student": 0.26,
      "country": "UK",
      "logo": "https://i.ibb.co.com/0hw7Fv1/39-Robert-Gordon-University.png"
    },
    {
      "Name": "University of Gloucestershire",
      "Overview": "The University of Gloucestershire (UoG) is a vibrant institution committed to nurturing career-ready graduates through a diverse range of undergraduate and postgraduate programs. With a strong focus on employability, UoG collaborates closely with industry, ensuring that courses are relevant and practical. The university is known for its supportive environment, boasting a 96% graduate employment rate and various career services, including lifetime career coaching. Its campuses, located in Gloucester and Cheltenham, offer state-of-the-art facilities and a unique blend of city and countryside living, enriched by numerous cultural events and activities​",
      "History": "The University of Gloucestershire has a rich educational heritage that dates back to 1847, when it was established as Cheltenham Training College by Reverend Francis Close. Initially focusing on training teachers, the institution evolved over the years, becoming St Paul’s and St Mary’s Colleges in 1921 and later the Cheltenham and Gloucester College of Higher Education in 1990. It achieved university status in 2001, officially becoming the University of Gloucestershire. Today, it offers a diverse range of undergraduate, postgraduate, and research degrees across its campuses in Cheltenham and Gloucester",
      "Ranking & Achievement": "The University of Gloucestershire has made significant strides in various rankings, recently climbing 22 places in The Times and The Sunday Times Good University Guide 2025, positioning itself as the highest-ranked institution in Gloucestershire. This improvement reflects the university's commitment to enhancing the student experience and educational outcomes, evidenced by strong performances in teaching quality and graduate employment rates.\n\nAdditionally, the university marked its first appearances in the QS World University Rankings: Sustainability and the Times Higher Education World University Rankings. It was placed in the 771-780 group overall in the QS ranking and ranked in the top 300 for Environmental Sustainability​. This recognition underscores the university's dedication to tackling environmental challenges and achieving net zero carbon emissions by 2030.",
      "courses": "Business & Management (Human Resource Management) BA (Hons)\nBusiness Management (Enterprise & Innovation) BA (Hons)\nAccounting and Finance BSc (Hons)\nClinical and Health Psychology BSc (Hons)\nCreative Writing BA (Hons)\nForensic Psychology BSc (Hons)\nZoology BSc (Hons)\nVisual Communication (Level 6) BA (Hons)\nFilm Production BA (Hons)\nData Science (HTQ) CertHE",
      "Department & Faculty": "School of Business, Computing and Social Sciences\nSchool of Health and Social Care\nSchool of Arts\nSchool of Education\nSchool of Natural and Social Sciences\nSchool of Sport and Exercise\nSchool of Media\nSchool of Music\nSchool of Psychology\nSchool of Law",
      "Fee": "£11,400 to  £17,800",
      "Services": "Mental Health and Wellbeing Support\nDisability Support Services\nCareer Services (Student Futures)\nAccommodation Services\nStudent Finance Guidance\nStudent Union Activities\nInternational Student Support\nAcademic Support\nCounseling Services\nSports and Recreation Facilities",
      "Accommodation": "The University of Gloucestershire offers a variety of accommodation options for students, including halls of residence located in Cheltenham and Gloucester. They guarantee a place in halls for all first-year undergraduate, postgraduate, and international students who accept an offer. The accommodation includes around 1,900 self-catered rooms, most of which are en-suite, with prices ranging from £150 to £240 per week, depending on the type of room. These contracts typically include all utility bills and basic contents insurance, with a duration of about 40 weeks​",
      "established": 2001,
      "rank": "771-780",
      "location": " Cheltenham and Gloucester, England, UK",
      "international student": 0.25,
      "country": "UK",
      "logo": "https://i.ibb.co.com/dMqcFM6/40-University-of-Gloucestershire.png"
    },
    {
      "Name": "UWS London Campus",
      "Overview": "The University of the West of Scotland (UWS) London Campus offers a vibrant and multicultural environment for students. Located in one of the world’s leading student cities, the campus provides access to a wide range of academic programs, networking opportunities, and an engaging student life. Students can benefit from UWS's focus on career-oriented education, which is aligned with industry needs, helping to create highly sought-after graduates. The London campus complements UWS’s commitment to innovation and research, aiming to equip students with the skills necessary for success in their careers.",
      "History": "The University of the West of Scotland (UWS) established its London Campus to extend its reach and provide a global educational experience. Located in the Docklands area, this campus offers modern and flexible learning spaces with panoramic views of London. It is strategically placed just a minute’s walk from East India DLR station, facilitating easy access to the vibrant cultural and professional opportunities the city offers. UWS London aims to foster a diverse and dynamic learning environment, catering to both local and international students while aligning its courses with global employment needs.",
      "Ranking & Achievement": "The University of the West of Scotland (UWS) is recognized for its strong performance in various global rankings. Notably, it was placed in the top 150 universities under 50 years old in the Times Higher Education Young University Rankings 2022. Furthermore, UWS achieved a remarkable distinction in the 2023 rankings, being listed among the top 300 universities worldwide for its impact on the United Nations’ Sustainable Development Goals (SDGs), specifically ranked second in Scotland for reducing inequalities .",
      "courses": "MBA with Banking and Finance\nMBA with Digital Marketing\nMBA with Leadership\nMBA with Logistics and Supply Chain Management\nMBA with Luxury Branding\nMSc International Management\nMSc Human Resource Management\nMSc Digital Marketing\nMSc International Events Management\nMSc Finance & Accounting with CIMA",
      "Department & Faculty": "School of Business and Creative Industries\nSchool of Computing, Engineering and Physical Sciences\nSchool of Education\nSchool of Health and Life Sciences\nSchool of Media, Culture and Society\nSchool of Social Sciences",
      "Fee": "£13,080 to £18,000",
      "Services": "Library Services\nStudent Support and Wellbeing\nInternational Student Support\nAccommodation Assistance\nCareer Services\nAcademic Skills Support\nPersonal Development Planning\nHealth and Wellbeing Services\nSports and Physical Activity\nIT Support Services",
      "Accommodation": "At the University of the West of Scotland (UWS) London Campus, students typically arrange their own accommodation, either through private rentals or managed residences. While UWS provides various self-catered accommodation options at its other campuses, the London Campus focuses on offering guidance and support for students seeking housing in the city. Living in university accommodation is highly beneficial for fostering friendships and gaining independence, and UWS ensures that students have access to necessary resources during their stay​",
      "established": 2010,
      "rank": "385th",
      "location": "Import Building, 2 Clove Cres, London E14 2BE, UK",
      "international student": 0.55,
      "country": "UK",
      "logo": "https://i.ibb.co.com/JkHvPZf/UWS-London-Campus.png"
    },
    {
      "Name": "Newcastle University (INTO Partner)",
      "Overview": "Newcastle University is a prestigious institution in the UK, recognized as a Global Top 125 university and a founding member of the Russell Group. Its origins trace back to 1834, with a strong commitment to research excellence, especially in areas such as health, culture, and data science. The university has been awarded 5+ QS Stars for Excellence and is ranked first in the UK for sustainable development.\n\nWith over 300 degrees available, Newcastle University emphasizes a rich learning environment supported by modern facilities, including a state-of-the-art engineering hub set to open in 2024. The vibrant campus is located in one of the UK's most affordable cities and hosts a diverse community of 29,000 students from 140 countries. The university also offers robust career support and funding opportunities for both UK and international students.",
      "History": "Newcastle University traces its origins back to 1834 when the School of Medicine and Surgery was founded in Newcastle. Over time, it evolved through various mergers and changes, including becoming Armstrong College in 1906, named after local industrialist Sir William Armstrong. The college was later incorporated into Durham University but became an independent university in 1963, formally establishing Newcastle University. Its historical Armstrong Building, one of the oldest on campus, played a significant role during both World Wars, highlighting the university's rich heritage",
      "Ranking & Achievement": "Newcastle University is currently ranked as follows in major UK university league tables:\n\n30th in the Times/Sunday Times Good University Guide 2025\n26th in the Complete University Guide 2025\n63rd in The Guardian University Guide 2025\nIt is also recognized among the top 10 in the UK for sustainability and social impact according to the QS World University Rankings: Sustainability 2024​",
      "courses": "Architecture BA Honours\nBiology BSc Honours\nBusiness Management BSc Honours\nCivil Engineering BEng Honours\nComputer Science BSc Honours\nEconomics BSc Honours\nEnglish Literature BA Honours\nPsychology BSc Honours\nLaw LLB Honours\nPharmacy MPharm\n",
      "Department & Faculty": "Faculty of Humanities and Social Sciences\nFaculty of Medical Sciences\nFaculty of Science, Agriculture and Engineering\nFaculty of Arts, Design and Social Sciences\nFaculty of Business\nFaculty of Education, Communication and Language Sciences\nFaculty of Law\nFaculty of Engineering\nFaculty of Health and Life Sciences\nFaculty of Medicine",
      "Fee": "£22,200 and £31,200 ",
      "Services": "Careers Service\nStudent Support and Wellbeing\nIT Support Services\nVisa Support\nAccommodation Services\nStudent Progress Services\nDisability Support\nLibrary Services\nHealth and Safety Services\nInternational Student Support",
      "Accommodation": "Newcastle University offers a range of accommodation options for students, tailored to various needs and preferences. The accommodation includes standard rooms, en-suite rooms, and studio apartments, with the majority of options designed for single-occupancy living. Shared facilities typically include kitchens and communal spaces. All rooms come equipped with essential furniture, and rents are inclusive of utilities such as heating, lighting, water, and internet access. For students enrolling for a full academic year, university accommodation is guaranteed if eligibility criteria are met, while part-year exchange students are encouraged to apply but may not have guaranteed housing.",
      "established": 1963,
      "rank": "30th",
      "location": "Newcastle upon Tyne NE1 7RU, UK",
      "international student": 0.26,
      "country": "UK",
      "logo": "https://i.ibb.co.com/2SdCYtc/newcastle-university.png"
    },
    {
      "Name": "London South Bank University",
      "Overview": "London South Bank University (LSBU) is located in Southwark, London, and offers a central city experience just a short distance from iconic landmarks such as the South Bank of the Thames, Waterloo, and London Bridge. Known for its practical, industry-focused education, LSBU has a strong emphasis on employability and skills development. The university supports over 3,000 apprenticeships and collaborates with various sectors to provide hands-on learning through its range of programs in areas like engineering, health, and business.",
      "History": "London South Bank University (LSBU) was founded in 1892 as the Borough Polytechnic Institute, with the aim of providing education and skills training for the local community. Over the years, the university has maintained a strong focus on vocational education and links with industry, adapting its curriculum to meet the needs of a modern, global economy. LSBU gained university status in 1992 and has since expanded its offerings, becoming known for its expertise in engineering, business, health, and the arts. Today, it is recognized for fostering entrepreneurship and innovation through programs like the London Knowledge Innovation Centre.",
      "Ranking & Achievement": "London South Bank University (LSBU) has recently achieved significant recognition, ranking third in the world for its efforts in reducing inequality according to the Times Higher Education Impact Rankings 2024. This ranking evaluates universities based on their research addressing social inequalities, policies against discrimination, and commitment to diversity among staff and students. LSBU's performance reflects its dedication to creating an inclusive environment and contributing to the United Nations Sustainable Development Goals​",
      "courses": "BA (Hons) Accounting and Finance\nBSc (Hons) Computer Science\nBSc (Hons) Psychology\nBEng (Hons) Mechanical Engineering\nBA (Hons) Business Management\nBSc (Hons) Nursing\nMSc Public Health\nMSc Cyber Security\nBA (Hons) International Relations\nMSc Construction Project Management",
      "Department & Faculty": "School of Arts and Creative Industries\nSchool of Business\nSchool of Engineering\nSchool of Health and Social Care\nSchool of Law and Social Sciences\nSchool of the Built Environment and Architecture\nSchool of Education\nSchool of Media and Communication\nSchool of Science\nSchool of Psychology",
      "Fee": "£15,000 and £19,000",
      "Services": "Student Support Services\nAccommodation Services\nCareer Services\nInternational Student Support\nDisability Support\nHealth and Wellbeing Services\nAcademic Skills Support\nFinancial Support\nStudents' Union Services\nCounseling and Mental Health Services",
      "Accommodation": "London South Bank University (LSBU) offers a variety of modern and vibrant accommodation options for students, including McLaren House, which features ensuite facilities and is conveniently located near the Southwark campus. This residence is designed to support a lively student experience, with amenities tailored to student needs. For the 2024/25 academic year, prices for accommodation vary, and students can apply for housing through the university’s official site.",
      "established": 1892,
      "rank": "third in the world",
      "location": "103 Borough Rd, London SE1 0AA, UK",
      "international student": 0.33,
      "country": "UK",
      "logo": "https://i.ibb.co.com/0BVcWs5/73-London-South-Bank-University.png"
    },
    {
      "Name": "Regent’s University",
      "Overview": "Regent's University London is a prestigious institution located in the heart of London, surrounded by the scenic Regent's Park. The university prides itself on fostering creativity and innovation among its diverse student body, which includes individuals from over 140 countries. With a focus on developing future-ready skills, Regent's offers a wide range of undergraduate and postgraduate programs in areas such as business, arts, humanities, and social sciences.",
      "History": "Regent's University London has a rich history that dates back to 1892 when it was founded as the Regent's College, primarily for training individuals in higher education. It became a university in 2013, evolving from its earlier role in various educational programs. The institution is uniquely situated within Regent’s Park, one of the Royal Parks of London, offering a picturesque setting for its campus. Over the years, Regent’s has expanded its focus to include a diverse range of subjects, emphasizing a global perspective and strong industry connections. This has allowed the university to develop a reputation as a hub for creative and business-oriented education. Notably, the institution emphasizes cultivating internationally minded graduates, fostering an environment that supports personal and professional growth​.\n",
      "Ranking & Achievement": "Regent's University London has made significant strides in student satisfaction rankings. In the latest National Student Survey (NSS), it achieved an overall satisfaction rate of 82.5%, placing it 3rd among universities in London and 9th in England overall​ . The university excels particularly in its learning community, where it ranked 4th in London. Regent's commitment to personalized education and its strong emphasis on student engagement have contributed to these positive results.\n",
      "courses": "Acting for Stage and Screen BA (Hons)\nBusiness and Data Science BA (Hons)\nFashion Design BA (Hons)\nInternational Business BA (Hons)\nMedia and Communications BA (Hons)\nPsychology BA (Hons)\nDigital Marketing and Analytics BSc (Hons)\nInternational Relations BA (Hons)\nLuxury Hospitality Management BA (Hons)\nScreenwriting and Producing BA (Hons)",
      "Department & Faculty": "Business & Management\nFashion & Design\nFilm, Media & Performance\nLiberal Arts & Humanities\nPsychotherapy & Psychology\nLanguages\nRegent's School of English ",
      "Fee": " £18,000 to £20,000",
      "Services": "Accommodation Services\nLibrary Services\nCareers, Enterprise & Industry\nStudent Support Services\nInternational Student Services\nAlumni Services\nMedia Services\nHealth & Wellbeing Services\nEvents & Conferences\nStudent Union Services",
      "Accommodation": "Regent's University London offers a variety of accommodation options primarily centered around Reid Hall, their main on-campus residence. This hall features a mix of single and twin rooms, accommodating around 200 students in a secure and communal environment. Each room is furnished and equipped with free Wi-Fi, while the building provides communal bathrooms and a kitchen area on each floor. For the 2024/2025 academic year, prices start at £470 per week for single rooms and £370 per week for twin rooms, both inclusive of meal credits for dining on campus​.",
      "established": 1984,
      "rank": " 4th in London",
      "location": "Inner Cir, London NW1 4NS, UK",
      "international student": 0.45,
      "country": "UK",
      "logo": "https://i.ibb.co.com/9cYzt7R/64-Regent-s-University.png"
    },
    {
      "Name": "University of Huddersfield",
      "Overview": "The University of Huddersfield is renowned for its strong emphasis on teaching quality and industry engagement. It ranks highly in the UK, with its teaching staff being among the top three in England for holding doctorates and other higher degrees. The university has also won numerous National Teaching Fellowships, showcasing its excellence in higher education instruction. Huddersfield's commitment to employability is reflected in its impressive graduate outcomes, with over 96% of undergraduates and postgraduates securing employment or continuing their studies within 15 months of graduation. All undergraduate students are guaranteed professional work experience during their course, further enhancing their career prospects.",
      "History": "The University of Huddersfield traces its origins to 1841 when it was founded as the Young Men’s Mental Improvement Society. Over the years, it evolved into a technical college and later merged with other institutions. It officially gained university status in 1992. The institution has grown from a local educational society into a full-fledged university, renowned for its focus on practical learning and its research output.",
      "Ranking & Achievement": "The University of Huddersfield has made significant progress in recent global rankings. It is currently ranked 567th in the 2024 QS World University Rankings, placing it in the top 2% of universities worldwide. Additionally, Huddersfield has been recognized in 13 different subjects in the QS World University Rankings by Subject, with standout performances in Music (20th globally), Performing Arts (32nd globally), and Communication & Media Studies (top 150). The university's strong reputation is also reflected in its high proportion of teaching staff with formal qualifications, leading the UK in this metric.",
      "courses": "Business Management BA(Hons)\nComputer Science BSc(Hons)\nMechanical Engineering BEng(Hons)\nArchitecture BA(Hons)\nMarketing with Digital Marketing BA(Hons)\nNursing (Adult) BSc(Hons)\nMusic Technology and Audio Systems BSc(Hons)\nSoftware Engineering MEng\nPharmaceutical Chemistry BSc(Hons)\nEconomics BSc(Hons)",
      "Department & Faculty": "School of Applied Sciences\nSchool of Arts and Humanities\nSchool of Business, Education and Law\nSchool of Computing and Engineering\nSchool of Human and Health Sciences\nSchool of Music, Humanities and Media\nSchool of Design\nSchool of Education\nSchool of Business\nSchool of Health and Social Care",
      "Fee": "£15,000 to £20,000",
      "Services": " \nLibrary \nWellbeing Support\nDisability Support\nCareers Service \nIT Support \nFinance, Fees, and Payments \nActiveHud \nStudent Union",
      "Accommodation": "\n\n\nThe University of Huddersfield offers a range of accommodation options through its preferred provider, DIGS Student, which includes Storthes Hall Park, a large student community with ensuite rooms, a gym, cinema, and social spaces. Prices are affordable, with Huddersfield being one of the least expensive areas for student rent in the UK, averaging around £340 per month.",
      "established": 1992,
      "rank": " 567th",
      "location": "Queensgate, Huddersfield HD1 3DH, UK",
      "international student": 0.2,
      "country": "UK",
      "logo": "https://i.ibb.co.com/NpnFT8f/18-University-of-Huddersfield.png"
    },
    {
      "Name": "University of Birmingham (Birmingham Campus)",
      "Overview": "The University of Birmingham, located in the heart of England, boasts a beautiful and expansive campus that spans 672 acres, with over 200 buildings of varying architectural styles and functions. It is known for its combination of historic and modern spaces, providing a vibrant environment for students, staff, and visitors.\n\nThe Edgbaston campus, a short distance from Birmingham city center, features a range of facilities including libraries, sports centers, and open green spaces. The university is undergoing a significant £1 billion redevelopment program aimed at enhancing its teaching and research capabilities, as well as improving student living conditions. This includes the creation of cutting-edge learning environments and sustainable social spaces.",
      "History": "The University of Birmingham, established in 1900, has a rich history rooted in the vision of its first Chancellor, Joseph Chamberlain. It emerged from the earlier Mason College, which was founded in 1875, and was notable for being England's first civic university, welcoming students from diverse backgrounds. The university's growth led to the development of its expansive 672-acre campus in Edgbaston, and it also established a campus in Dubai.\n\nThe university is known for its pioneering contributions to education and research, having been the first UK institution to incorporate a medical school, a Faculty of Commerce, and to welcome women into medical degrees. Its commitment to research is reflected in significant achievements, including the development of key medical technologies and a number of Nobel Prize awards.\n\nThe campus features historic redbrick buildings designed by architect Sir Aston Webb, including the prominent clock tower known as \"Old Joe,\" which stands as a symbol of the university's prestige. The university continuously evolves, balancing its rich heritage with modern advancements in education and research facilities.",
      "Ranking & Achievement": "The University of Birmingham has established itself as a leading institution with strong global rankings. According to the latest data:\nIn the QS World University Rankings 2025, Birmingham is ranked 80th globally and 12th among UK universities.\nThe Times Higher Education World University Rankings 2023 places it at 108th out of approximately 1,400 universities worldwide, and joint 12th among UK universities. Additionally, the Shanghai Jiao Tong University World Rankings categorizes Birmingham within the top 101-150 range, reflecting its competitive position among UK universities.The US News and World Report also ranks the university 91st globally, reaffirming its status as one of the top educational institutions​\ns​",
      "courses": "Aerospace Engineering BEng\nArtificial Intelligence and Computer Science BSc\nAncient History and Archaeology BA\nEducation BA (Hons)\nNursing BNurs - Adult\nPharmacy MPharm\nBusiness Management BSc\nEconomics BSc\nPsychology BSc\nPolitical Science and International Relations BA",
      "Department & Faculty": "College of Arts and Law\nCollege of Engineering and Physical Sciences\nCollege of Life and Environmental Sciences\nCollege of Medicine and Health\nCollege of Social Sciences",
      "Fee": "£27,180 to £30,000",
      "Services": "Student Services\nInternational Student Team\nStudent Disability Service\nMental Health and Wellbeing Team\nBirmingham International Academy\nLibrary Services\nAcademic Services\nCareer Services\nStudent Communications Team\nCampus Services",
      "Accommodation": "The University of Birmingham offers a variety of accommodation options tailored to meet the diverse needs of students, particularly international students. Their accommodation is primarily located within three villages: The Vale, Selly Oak, and Pritchatts Park, each providing a unique living environment.",
      "established": 1900,
      "rank": "80th globally ",
      "location": "Birmingham B15 2TT, UK",
      "international student": 0.2,
      "country": "UK",
      "logo": "https://i.ibb.co.com/rddYydY/birmingham-city-university.png"
    },
    {
      "Name": "University of Birmingham  ( dubai campus)",
      "Overview": "The University of Birmingham Dubai is located in the heart of Academic City and officially opened its new state-of-the-art campus in 2022. It marks the university's commitment to providing high-quality education and fostering innovation in the UAE. This campus is notable for being the first global top 100 British university to establish a presence in Dubai, reflecting the rich heritage of the original Birmingham campus while integrating Arabic cultural elements.\n\nDesigned to accommodate up to 3,000 students initially, the campus features innovative learning spaces, including lecture theatres, laboratories, and flexible study areas that encourage collaboration across disciplines. The facilities are equipped with advanced technology to support a \"digital first\" approach to education. This includes IoT-enabled systems that help students manage their study spaces and receive notifications about campus events.",
      "History": "The University of Birmingham established its Dubai campus in 2018, becoming the first UK Russell Group university to open a branch in the UAE. The Dubai campus is located in Dubai International Academic City (DIAC) and aims to deliver high-quality education while contributing to the region's educational landscape. In 2022, the campus was officially inaugurated, showcasing state-of-the-art facilities designed to support a student population of up to 2,900, with plans to accommodate 4,500 in the future​. The new campus reflects both the heritage of the Birmingham campus and the architectural beauty of Arabic culture.Offering a variety of undergraduate and postgraduate programs, the Dubai campus is dedicated to maintaining the same academic standards as its UK counterpart, ensuring a consistent educational experience for students. This development underlines the University of Birmingham's commitment to expanding its global presence and fostering academic excellence in a rapidly developing education hub.\n",
      "Ranking & Achievement": "The University of Birmingham Dubai is notable for being the first Russell Group university to establish a campus in Dubai, officially opening in September 2018. This campus has gained recognition for its commitment to academic excellence and sustainable practices, boasting a state-of-the-art facility designed to support up to 4,500 students​ .\nIn terms of rankings, the University of Birmingham is highly regarded globally, consistently ranked among the top 100 universities worldwide. It currently holds the 80th position in the QS World University Rankings 2025 and 108th in the Times Higher Education World University Rankings 2023 . This emphasis on quality education and research is reflected in the degree programs offered, which maintain the same high standards as those provided on its UK campus​\n\n",
      "courses": "BSc Biomedical Science\nBSc Artificial Intelligence and Computer Science\nBSc Accounting and Finance\nBSc Business Management\nBA Digital Media and Communications\nMSc Financial Management\nMSc International Business\nMSc Human Resource Management\nMSc Marketing\nMSc Data Science\n\n\n",
      "Department & Faculty": "Birmingham Business School\nSchool of Computer Science\nSchool of Education\nSchool of Engineering\nSchool of Law\nSchool of Mathematics\nSchool of Medicine and Health\nSchool of Psychology",
      "Fee": "£23,310 to £28,350.",
      "Services": "Student Accommodation\nStudent Support Services\nLibrary Services\nScholarships and Financial Aid\nCourse Guidance and Enrollment\nIT Support and Resources\nHealth and Wellbeing Services\nCareer Services and Employability Support\nTransportation Services\nExtracurricular Activities and Clubs",
      "Accommodation": "At the University of Birmingham's Dubai campus, students have access to a variety of accommodation options designed to provide a comfortable living experience. The university collaborates with several accommodation providers located near the campus, including Dubai Silicon Oasis (DSOA) and KSK Homes.",
      "established": 2022,
      "rank": "108th in the world",
      "location": "Academic City - Dubai - United Arab Emirates",
      "international student": 0.6,
      "country": "UK",
      "logo": "https://i.ibb.co.com/rddYydY/birmingham-city-university.png"
    },
    {
      "Name": "QA Higher Education",
      "Overview": "QA Higher Education is a provider of educational programs in partnership with various universities in the UK. They specialize in offering undergraduate and postgraduate degrees, primarily focusing on business and computing subjects. Their mission is to not only equip students with degrees but also ensure they develop the skills and employability required in today's competitive job market.\n\nQA Higher Education emphasizes a supportive learning environment and provides a range of student support services, including academic guidance, mental health support, and accommodation assistance. Their courses are validated by their partner universities, ensuring high academic standards and recognition.",
      "History": "QA Higher Education has a mission centered around empowering students and enhancing their career prospects. Established in 2010, QA Higher Education partners with universities to deliver a range of undergraduate and postgraduate courses across various fields such as business, computing, and health. Their educational approach focuses on providing a supportive learning environment, ensuring that students are well-prepared for the demands of the modern workforce.\n\nQA Higher Education emphasizes flexible learning options, allowing students to balance their studies with personal and professional commitments. The institution is committed to maintaining high academic standards, with courses validated by partner universities​",
      "Ranking & Achievement": "QA Higher Education has been recognized for its strong performance in various rankings, reflecting its commitment to educational quality and student satisfaction. For instance, it was rated as a top 5 UK university based on student satisfaction according to The Complete University Guide 2024. Additionally, it ranked within the top 10 UK universities for teaching quality as per The Guardian University Guide 2024. ",
      "courses": "BSc (Hons) Cyber Security with Foundation Year\nExtended MSc Human Resource Management\nMA Luxury Brand Management\nMSc Business with Business Analytics\nMBA with Advanced Practice\nInternational Foundation Programme\nInternational Year One Business\nPre-Master’s Programme\nBSc (Hons) Business Management\nMA/MSc Innovation and Creative Strategy",
      "Department & Faculty": "Business\nComputing\nHospitality and Tourism Management\nHuman Resource Management\nMarketing\nInternational Business\nData Analytics\nLuxury Brand Management\nEntrepreneurship\nCreative Strategy",
      "Fee": "£14,000 to £17,000",
      "Services": "Student Welfare Suppor\nAcademic Help Hubs\nThe ACE Team\nFinance Support\nCareers Services\nAccommodation Assistance\nBlended Learning Options\nPre-Masters Programme\nAssessment Testing\nLibrary Services\n\n",
      "Accommodation": "QA Higher Education provides accommodation support for students studying at their partner universities across the UK. They do not own or directly provide accommodation but facilitate connections between students and third-party providers. Their Accommodation Service aims to help students find suitable living arrangements that meet their needs and budget.\n\nOn-campus accommodation is available at several pathway colleges, and students applying before the end of July are often guaranteed a place. For those who choose on-campus housing, they will enter into a contract directly with the university. If on-campus options are not available, QAHE directs students to various private accommodation resources.",
      "established": 1996,
      "rank": "no rank ",
      "location": "St James House, 10 Rosebery Ave, London EC1R 4TF, United Kingdom",
      "international student": 0.45,
      "country": "UK",
      "logo": "https://i.ibb.co.com/9T1h81B/QA-Higher-Education.png"
    },
    {
      "Name": "University of Glasgow",
      "Overview": "The University of Glasgow, established in 1451, is a distinguished institution located in Scotland and ranks among the world's top 100 universities. It is a member of the prestigious Russell Group, known for its research excellence. The university is committed to addressing global challenges and is actively working towards the United Nations’ Sustainable Development Goals, including a pledge to achieve carbon neutrality by 2030.With a rich history, the university has produced numerous notable alumni, including Nobel Laureates and prominent political figures. It emphasizes inclusivity and has been recognized for providing a welcoming environment for refugees and asylum seekers through its \"University of Sanctuary\" status.\n",
      "History": "The University of Glasgow, founded in 1451, is the fourth oldest university in the English-speaking world and has a rich history intertwined with significant cultural and scientific advancements. Initially established as a center for teaching and learning in the medieval tradition, the university has evolved over the centuries to become a leading institution in various fields.\n\nThroughout its history, the University of Glasgow has been home to numerous notable figures and groundbreaking developments. Among its alumni, Adam Smith, known as the father of modern economics, laid the foundations for economic theory, while Joseph Lister pioneered antiseptic surgical practices, dramatically improving medical outcomes. The university also played a role in significant inventions, including the first working television system demonstrated by John Logie Baird​.",
      "Ranking & Achievement": "The University of Glasgow is recognized among the top universities in the world, consistently ranking in the global top 100. In the 2024 QS World University Rankings, it was placed 80th, while the Times Higher Education World University Rankings positioned it at 139th globally. The university is well-regarded for its research output and overall academic performance, with particular strengths in areas such as the arts, humanities, and social sciences​\n",
      "courses": "Biomedical Engineering [BEng/MEng]\nBusiness & Management [BSc/MA/LLB/MA(SocSci)]\nCivil Engineering [BEng/MEng]\nEconomics [BAcc/BSc/MA/MA(SocSci)]\nPhilosophy [BSc/MA/MA(SocSci)]\nPsychology [BSc/MA/MA(SocSci)]\nLaw [LLB]\nMarine & Freshwater Biology [BSc/MSci]\nMechanical Engineering [BEng/MEng]\nInternational Relations [MA(SocSci)]",
      "Department & Faculty": "Faculty of Arts\nFaculty of Education\nFaculty of Law\nFaculty of Medicine, Dentistry & Health\nFaculty of Science\nFaculty of Social Sciences\nCollege of Arts\nCollege of Medical, Veterinary & Life Sciences\nCollege of Science & Engineering\nCollege of Social Sciences",
      "Fee": " £23,500 and £36,800",
      "Services": "Careers Service\nCounselling & Psychological Services\nInternational Student Support\nDisability Service\nChaplaincy\nResidence Life\nPeer Wellbeing Support\nStudent Support Officers\nStudent Services Enquiry Team\nCost of Living Support\n",
      "Accommodation": "At the University of Glasgow, student accommodation is designed to support a vibrant campus life, offering various options for both undergraduate and postgraduate students. The university provides a range of housing styles, including traditional halls of residence, modern apartments, and self-catered flats. All accommodations are located close to the campus, ensuring easy access to facilities and services.",
      "established": 1451,
      "rank": "139th globally",
      "location": "Glasgow G12 8QQ, UK",
      "international student": 0.43,
      "country": "UK",
      "logo": "https://i.ibb.co.com/RTKY1x1/90-University-of-Glasgow.jpg"
    },
    {
      "Name": "University of Bedfordshire",
      "Overview": "The University of Bedfordshire offers a diverse and inclusive educational environment, committed to providing high-quality education and a supportive atmosphere for all students. With campuses located in Luton, Bedford, and Aylesbury, the university is situated in vibrant towns that combine rich cultural heritage with modern amenities, including shopping and entertainment.\n\nThe institution focuses on enhancing student learning through practical experiences, fostering community engagement, and promoting innovation in teaching and research. It offers a wide range of undergraduate and postgraduate programs across various disciplines, preparing students for successful careers in a global environment.",
      "History": "The University of Bedfordshire has a rich educational history, originating from its teacher training roots in Bedford. The history dates back to 1882 when a Kindergarten school was established, which led to the creation of the Bedford Training College. This institution became a pioneer in promoting the Froebel methods of education, focusing on holistic child development through play and exploration.\n\nThe college evolved significantly over the years, particularly in response to changing educational needs and government policies. It gained university status in 1992 as the University of Luton and later merged with the Bedford campus of De Montfort University in 2006 to become the University of Bedfordshire. This transformation was part of its expansion into a modern institution with a diverse and vibrant student body, offering a wide range of degree courses tailored to student needs​",
      "Ranking & Achievement": "The University of Bedfordshire is currently ranked 129th in the UK according to the Complete University Guide for 2025. In the Guardian University Guide, it holds the 122nd position for the same year. Additionally, the Times and Sunday Times rankings place it at 129th for 2025 as well​.On a global scale, the university is listed in the Times Higher Education World University Rankings for 2024, falling within the 1001-1200 range​. The institution has also been recognized for its quality of education and innovation, earning a Silver rating in the Teaching Excellence Framework in 2017​.\n",
      "courses": "BA (Hons) Business Management\nBSc (Hons) Computer Science\nBA (Hons) Creative Writing\nBSc (Hons) Psychology\nBSc (Hons) Nursing\nBA (Hons) Film and Television Production\nBSc (Hons) Marketing\nBA (Hons) Fashion Design\nBSc (Hons) Social Work\nBSc (Hons) Games Design",
      "Department & Faculty": "University of Bedfordshire Business School\nFaculty of Creative Arts, Technologies and Science\nFaculty of Education, English and Sport\nFaculty of Health and Social Sciences",
      "Fee": "£13,000 to £15,600.",
      "Services": "Student Support \nCareers and Employability Service \nAccommodation Services \nStudent Experience Services \nSport Services \nCommunity & Faith Services \nTimetabling \nAlumni Services\nResearch Services \nExams and Assessment Information\n\n",
      "Accommodation": "At the University of Bedfordshire, student accommodation is primarily offered through the Luton Student Village, which includes Fitzroy Court— the university's only officially endorsed accommodation in Luton. This facility provides a variety of living options, including modern studios and en-suite rooms, all fully furnished with comfortable beds, storage space, and desks for studying.\n\nAccommodation features include all bills included (such as utility costs), free Wi-Fi in every bedroom, 24/7 staff support, on-site security with CCTV, and access to a free gym. There are also numerous communal spaces and a range of activities designed to foster social interactions among students​",
      "established": 2006,
      "rank": " 129th in the UK ",
      "location": "Vicarage St, Luton LU1 3JU, UK",
      "international student": 0.29,
      "country": "UK",
      "logo": "https://i.ibb.co.com/8xhhqKR/45-University-of-Bedfordshire.png"
    },
    {
      "Name": "University of the West of Scotland",
      "Overview": "The University of the West of Scotland (UWS) is a public university with a strong focus on practical, career-oriented education. Spread across multiple campuses in the UK, it serves a diverse student body, offering a wide range of undergraduate and postgraduate programs. UWS is recognized for its innovative teaching, research output, and community engagement.\n",
      "History": "UWS was established in 2007 following the merger of the University of Paisley and Bell College in Hamilton. However, its roots trace back to 1897 when the Paisley Technical School was founded. Over time, it evolved into the University of Paisley, which later merged to form UWS. Today, UWS is one of Scotland’s largest modern universities.\n",
      "Ranking & Achievement": "UWS has made steady progress in various national and international rankings. Although traditionally categorized as a modern university, it has earned a reputation for its applied research, industry connections, and commitment to widening access to higher education. It is frequently ranked within the top 150 universities under 50 years old globally by Times Higher Education.\nRecognized for employability-focused programs.\nStrong partnerships with industries in Scotland and internationally.\nAchievements in areas like healthcare, engineering, and social sciences research.",
      "courses": "Business and Creative Industries\nComputing, Engineering, and Physical Sciences\nEducation and Social Sciences\nHealth and Life Sciences",
      "Department & Faculty": "School of Business and Creative Industries\nSchool of Computing, Engineering, and Physical Sciences\nSchool of Education and Social Sciences\nSchool of Health and Life Sciences",
      "Fee": "£13,000 to £15,500 annually",
      "Services": "Career counseling and employability services\nAcademic support and tutoring\nMental health and well-being services\nLibraries, study spaces, and IT facilities\nSports and recreation facilities\nFinancial aid and scholarships for eligible students",
      "Accommodation": "UWS offers on-campus and private student accommodation options across its campuses. On-campus housing includes modern, fully furnished rooms with utilities and internet included. Rent prices vary depending on the location and type of accommodation, typically starting from around £100 per week.\n",
      "established": "Paisley",
      "rank": " UWS ranked 101st in the UK",
      "location": 2007,
      "international student": null,
      "country": "UK",
      "logo": "https://i.ibb.co.com/Yjpgbm4/University-of-the-West-of-Scotland.jpg"
    },
    {
      "Name": "Glasgow Caledonian University",
      "Overview": "Glasgow Caledonian University (GCU) is a public university located in Glasgow, Scotland. Known for its social mission of promoting the common good, GCU offers a wide range of undergraduate and postgraduate programs across various disciplines, including business, engineering, computing, health sciences, and social sciences. GCU emphasizes global engagement, sustainability, and inclusivity, making it a popular choice for both domestic and international students.\n",
      "History": "GCU was founded in 1993 following the merger of The Queen's College, Glasgow (founded in 1875), and Glasgow Polytechnic (founded in 1971). Though a relatively young university, it has quickly established itself as a forward-thinking institution with a strong commitment to social justice. Over the years, GCU has built a reputation for excellence in research and teaching, with a particular focus on health, engineering, and business disciplines.\n",
      "Ranking & Achievement": "Global Rankings: GCU consistently ranks within the top 1000 universities globally and often in the top 100 of young universities worldwide.\nUK Ranking: In the UK, GCU often places within the top 100 universities, with its nursing, business, and engineering programs receiving special recognition.\nAchievements:\nGCU was awarded Ashoka U Changemaker Campus status, recognizing its efforts in social innovation and responsibility.\nGCU has received accolades for its sustainability initiatives and was the first university in Scotland to achieve the EcoCampus Platinum Award.\nIt was the first Scottish university to be designated a Fairtrade University.",
      "courses": "Business School:\nBBA and MBA in Business Administration\nMSc Finance\nMSc International Marketing\nSchool of Engineering & Built Environment:\nBEng/MEng in Civil Engineering\nBSc Computer Science\nMSc Electrical and Electronic Engineering\nSchool of Health and Life Sciences:\nBSc Nursing\nMSc Physiotherapy\nMSc Public Health",
      "Department & Faculty": "Glasgow School for Business and Society\nSchool of Engineering and Built Environment\nSchool of Health and Life Sciences",
      "Fee": "£12,000 to £15,000 per year",
      "Services": "Academic Support: Library services, tutoring, and access to online resources.\nCareer Services: Career counseling, internship placement, and job search assistance.\nStudent Wellbeing: Counseling services, mental health support, and disability services.\nSports and Recreation: GCU has a state-of-the-art gym, sports teams, and various clubs to support student fitness and recreation.",
      "Accommodation": "GCU offers modern and affordable student accommodations. The university's Caledonian Court is its primary student residence, located just a few minutes from the main campus. Rent typically ranges from £115 to £150 per week, depending on the type of room. Facilities include laundry rooms, Wi-Fi, study spaces, and communal areas.\n",
      "established": "Cowcaddens Rd, Glasgow G4 0BA, United Kingdom",
      "rank": "ranks within the top 1000 universities.",
      "location": 1993,
      "international student": null,
      "country": "UK",
      "logo": "https://i.ibb.co.com/yVfDD7m/90-University-of-Glasgow.jpg"
    },
    {
      "Name": "London Metropolitan University",
      "Overview": "London Metropolitan University (London Met) is a public university located in London, England. It provides a diverse range of undergraduate, postgraduate, and professional courses, focusing on preparing students for the workforce through practical, career-oriented programs. London Met prides itself on fostering inclusivity, diversity, and providing opportunities for students from all backgrounds. It is well-known for its strong links with industries and focus on employability, offering students real-world experience during their studies.\n",
      "History": "London Metropolitan University was formed in 2002 through the merger of two longstanding educational institutions: the University of North London and London Guildhall University. Its origins trace back to the 1848 foundation of the Metropolitan Evening Classes for Young Men, which later became London Guildhall University. London Met has a rich tradition of education in London, reflecting a commitment to social mobility and the local community.\n",
      "Ranking & Achievement": "London Met's rankings vary depending on the specific subject or course, but overall, it is considered a mid-tier UK university. The university is highly regarded for its career-focused education and strong industry connections. Although it may not consistently rank among the top universities in national or international rankings, its commitment to employability has earned it a positive reputation among students looking to enter the workforce directly after graduation.\n",
      "courses": "Business and Management\nComputer Science and IT\nSocial Sciences and Humanities\nLaw and Criminology\nArts and Design\nHealth and Wellbeing\nEducation\nArchitecture and the Built Environment",
      "Department & Faculty": "School of Business and Law\nSchool of Computing and Digital Media\nSchool of Social Sciences\nSchool of Art, Architecture and Design\nSchool of Human Sciences",
      "Fee": "£13,250–£16,000 per year.",
      "Services": "Career Services: Helping students find internships, placements, and employment opportunities.\nCounseling and Wellbeing: Offering mental health support, counseling, and well-being programs.\nStudent Union: Providing social activities, clubs, and societies to enrich student life.\nLibrary and IT Services: Modern libraries with access to online resources, e-books, and IT support.",
      "Accommodation": "University-managed halls of residence.\nPrivate student accommodations like Unite Students, Liberty Living, and others.\nHomestay options with local families.",
      "established": "166-220 Holloway Rd, London N7 8DB, United Kingdom",
      "rank": " generally ranks in the lower tier of UK universities",
      "location": 2002,
      "international student": null,
      "country": "UK",
      "logo": "https://i.ibb.co.com/0yyJq1y/81-London-Metropolitan-University.png"
    },
    {
      "Name": "Ravensbourne University",
      "Overview": "Ravensbourne University London is a specialist, industry-focused university offering a wide range of digital media and design courses. Located in the heart of London, it has a reputation for fostering creativity and innovation, with a focus on preparing students for careers in the creative industries. Its courses are designed to merge design, technology, and entrepreneurship, enabling students to thrive in fields such as digital media, fashion, and architecture.\n",
      "History": "Ravensbourne was established in 1962 as the Bromley School of Art. Over the years, it evolved to meet the growing demands of the creative industries, relocating several times before settling in Greenwich Peninsula in 2010. The university's modern campus is renowned for its striking architectural design, reflecting its cutting-edge approach to teaching and learning.\n",
      "Ranking & Achievement": "Ravensbourne is consistently ranked among the top creative universities in the UK. While it may not be as high-profile in traditional academic rankings, it excels in industry partnerships, employability, and student satisfaction, particularly in creative disciplines. The university has earned multiple awards for its courses in digital media and design, and its students frequently win accolades at prestigious events like the Royal Television Society Awards and D&AD New Blood.\n",
      "courses": "Digital Media\nFashion Design\nAnimation\nGraphic Design\nArchitecture\nFilm and TV Production\nGame Design\nInteractive Digital Media",
      "Department & Faculty": "Design\nDigital Media\nTechnology\nBusiness & Innovation",
      "Fee": "£14,500 to £16,500 per yea",
      "Services": "Careers and Employability Service: Offering career advice, internship placements, and connections to industry partners.\nStudent Support: Providing academic assistance, counseling, and disability services.\nLibrary and Learning Resources: A well-equipped library with access to digital and physical media.\nTechnology Facilities: Including cutting-edge digital labs, editing suites, and production studios.",
      "Accommodation": "Ravensbourne University does not operate its own student accommodation but partners with nearby student housing providers in Greenwich and other parts of London. Accommodation options range from shared flats to private studios, with prices varying depending on the location and facilities. Greenwich Peninsula is a popular area for students due to its proximity to the campus and vibrant cultural scene.\n",
      "established": "Greenwich Peninsula",
      "rank": " not typically ranked alongside traditional academic institutions in global rankings,",
      "location": 1962,
      "international student": null,
      "country": "UK",
      "logo": "https://i.ibb.co.com/cTvh4Xs/Ravensbourne-University.png"
    },
    {
      "Name": "University of Sunderland",
      "Overview": "University of Sunderland is a public research university located in Sunderland, England. Known for its career-focused education, the university emphasizes practical experience and student employability. It offers a wide range of undergraduate and postgraduate courses and has a reputation for its work in fields like health, engineering, business, and media studies.\n",
      "History": "Founded in 1901 as Sunderland Technical College, the institution evolved over the years to become the University of Sunderland in 1992. Its history is rooted in providing technical and vocational education, which has influenced its current emphasis on practical learning and industry partnerships.\n",
      "Ranking & Achievement": "Rankings: The University of Sunderland has ranked steadily in the Times Higher Education World University Rankings and the Guardian University Guide. In recent years, it has been known for its student satisfaction, graduate employability, and teaching quality.\n\nAchievements: The university has received several accolades, including being shortlisted for the Times Higher Education University of the Year. It has also been recognized for its inclusivity, supporting students from diverse backgrounds, and for providing excellent support for international students.",
      "courses": "Business, Computing, Engineering, Nursing, Media Production, Psychology, MBA, MSc in Engineering, MA in Media and Communication, LLM, MSc in Public Health",
      "Department & Faculty": "Faculty of Business, Law, and Tourism\nFaculty of Technology\nFaculty of Health Sciences & Wellbeing\nFaculty of Arts and Creative Industries",
      "Fee": "£13,500 to £17,000 for full-time courses",
      "Services": "Career Support: Offering employability services, internships, and industry placements.\n\nStudent Support: Counselling, academic advising, and disability services.\n\nHealth Services: On-campus health centers and mental health services.",
      "Accommodation": "University-managed halls: Shared and private rooms with facilities such as study spaces, communal areas, and security services.\n\nPrivate rentals: A wide network of approved private accommodation near the campuses.",
      "established": " Sunderland",
      "rank": 1901,
      "location": 0.36,
      "international student": null,
      "country": "UK",
      "logo": "https://i.ibb.co.com/1sPVxkF/83-University-of-Sunderland.png"
    },
    {
      "Name": "University of Greenwich",
      "Overview": "The University of Greenwich, located in London and Kent, UK, offers a diverse and dynamic educational environment. It is known for its strong focus on employability, international partnerships, and a wide range of courses across multiple disciplines. The university aims to deliver quality education with an emphasis on practical skills, research, and innovation.\n",
      "History": "Founded in 1890 as Woolwich Polytechnic, the University of Greenwich became a university in 1992. Originally serving as a technical institute, it has evolved into a modern university with a global outlook. The institution’s roots in education and research have continued for over a century, establishing a legacy in science, engineering, and business education.\n",
      "Ranking & Achievement": "Student Satisfaction: It consistently performs well in national student surveys for student satisfaction.\nRankings:\nThe Times Higher Education (THE) World University Rankings lists it in the 601–800 range globally.\nIn the Complete University Guide for 2024, it ranks 94th in the UK.\nIt has also been recognized for its research quality, especially in fields like business and engineering.\nTeaching Excellence Framework (TEF): It has achieved Silver status for the quality of its teaching.\nSustainability: The university has consistently ranked in the top 5 for sustainability in the People and Planet University League.",
      "courses": "Business & Finance\nEngineering & Sciences\nLaw\nArchitecture & Design\nComputing & Mathematics\nSocial Sciences\nHealth & Education",
      "Department & Faculty": "Faculty of Business\nFaculty of Liberal Arts and Sciences\nFaculty of Education, Health, and Human Sciences\nFaculty of Engineering and Science",
      "Fee": "£15,000 to £17,500",
      "Services": "Career Services: Providing internships, job placements, career advice, and employer networking opportunities.\nStudent Wellbeing: Mental health support, counseling, and physical health services.\nInternational Student Support: Visa advice, orientation, and language support for international students.\nLibrary and Learning Resources: Extensive resources, including digital collections, study spaces, and academic support.",
      "Accommodation": "The university provides several accommodation options for students, including:\n\nOn-campus residence halls and off-campus private accommodations.\nCosts vary but typically range from £5,000 to £7,000 per academic year for on-campus housing.",
      "established": "UNESCO World Heritage Site ",
      "rank": 1992,
      "location": 0.15,
      "international student": null,
      "country": "UK",
      "logo": "https://i.ibb.co.com/60kqcqZ/84-University-of-Greenwich.png"
    },
    {
      "Name": "University of Worcester",
      "Overview": "The University of Worcester is a public university in Worcester, England. It is known for its inclusive ethos, commitment to sustainability, and a wide range of courses that are designed to prepare students for careers in various sectors. It has a strong focus on student experience and offers various support services to assist students in their personal and academic development.\n",
      "History": "The University of Worcester began as an Emergency Teacher Training College in 1946, shortly after the Second World War. It was awarded university status in 2005. Over the years, the university has expanded both its physical campus and academic offerings. It now encompasses four campuses across Worcester and boasts a wide array of programs in subjects like education, health sciences, arts, humanities, and business.\n",
      "Ranking & Achievement": "National Ranking: The University of Worcester is consistently ranked among the top universities in the UK for teaching quality and student satisfaction.\nStudent Satisfaction: High ratings in the National Student Survey (NSS).\nTeaching Excellence: Awarded Silver in the Teaching Excellence Framework (TEF).\nSustainability: Known for its sustainability initiatives, including being one of the first UK universities to be awarded a First Class award in the People & Planet University League for environmental and ethical performance.\nInclusivity: Recognized for its commitment to widening access to higher education, the university was awarded the Athena SWAN Bronze Award for gender equality in 2019.",
      "courses": "business, management, finance, computing, law, and marketing. nursing, psychology, sports science, midwifery, and paramedicine.history, sociology, creative arts, drama, and media.environmental science, geography, biology, and conservation.",
      "Department & Faculty": "£13,400 - £15,000",
      "Fee": "Career Services: Assisting students with internships, job placement, and career advice.\nDisability and Dyslexia Support: Providing tailored support to students with disabilities or learning differences.\nCounseling and Mental Health Services: Ensuring student well-being with on-campus counselors and support networks.\nLibrary and Learning Resources: The Hive, a joint university-public library, is a key facility for students.\nSports Facilities: Modern sports facilities including gyms, sports halls, and outdoor pitches.",
      "Services": "The University of Worcester provides a variety of accommodation options, including en-suite rooms and shared facilities. Students can choose to live on-campus or in university-managed housing off-campus. Rent ranges from approximately £110 to £160 per week, depending on the type of accommodation.\n",
      "Accommodation": "Worcester",
      "established": "ranked among the top universities",
      "rank": 1946,
      "location": " 8-10%",
      "international student": null,
      "country": "UK",
      "logo": "https://i.ibb.co.com/j6bRJyJ/85-University-of-Worcester.png"
    },
    {
      "Name": "University of East London",
      "Overview": "The University of East London (UEL) is a public university located in the London Borough of Newham. It was formally established in 1898 as the West Ham Technical Institute, evolving into a university in 1992. UEL serves approximately 17,000 students from over 135 countries, reflecting a diverse student body. The university's campuses are situated in Stratford and Docklands, with the University Square Stratford campus opening in 2013​",
      "History": "UEL's origins date back to the West Ham Technical Institute, which began operations following the Technical Instruction Act of 1889. The institution grew significantly over the years, gaining university status in 1992. Since then, UEL has focused on providing high-quality, internationally recognized education​",
      "Ranking & Achievement": "UEL is recognized as one of the UK's leading public universities, although its ranking varies across different metrics. In the 2023 Times Higher Education rankings, UEL is placed in the 801-1000 range globally. It is particularly noted for its research output and community engagement​",
      "courses": "Royal Docks School of Business and Law\nSchool of Education and Communities\nSchool of Health, Sport and Bioscience\nSchool of Psychology",
      "Department & Faculty": " around £13,500",
      "Fee": "UEL provides a range of student services, including academic support, career advice, and counseling. ",
      "Services": "Accommodation is available on campus, particularly at the Docklands and Stratford campuses, featuring modern facilities and amenities​",
      "Accommodation": "East London",
      "established": "801-1000 range globally",
      "rank": 1889,
      "location": 0.2,
      "international student": null,
      "country": "UK",
      "logo": "https://i.ibb.co.com/H7SCyCT/86-University-of-East-London.png"
    },
    {
      "Name": "University of Hull",
      "Overview": "The University of Hull is a public research university located in Hull, England. Established in 1927, it has a strong tradition of academic excellence and offers a wide range of undergraduate and postgraduate programs across various disciplines. The university is known for its supportive environment, innovative teaching, and emphasis on research.\n",
      "History": "Founded as a university in 1927, Hull was the first university in the UK to offer a degree in Social Sciences. It has since expanded and evolved, contributing significantly to higher education and research in the region. The university has undergone several transformations, including investments in modern facilities and an emphasis on international collaboration.\n",
      "Ranking & Achievement": "The University of Hull has been recognized for its academic performance and research impact. In the 2021 Research Excellence Framework (REF), it climbed 17 places to rank 55th overall in the UK, with 82% of its research recognized as world-leading or internationally excellent. Various departments have received specific accolades; for example, the university’s Business School has consistently ranked within the top 50 for several subjects​",
      "courses": "usiness, Law, Engineering, Health, Social Sciences, and Humanities.",
      "Department & Faculty": "Faculty of Arts, Cultures, and Education\nFaculty of Business, Law, and Politics\nFaculty of Health Sciences\nFaculty of Science and Engineering",
      "Fee": "£15,000 to £25,000 per year",
      "Services": "The university provides a comprehensive range of services, including an award-winning careers service, counseling, health services, and academic support​",
      "Accommodation": "Cottingham Road",
      "established": "it climbed 17 places to rank 55th overall",
      "rank": 1927,
      "location": 0.2,
      "international student": null,
      "country": "UK",
      "logo": "https://i.ibb.co.com/GRXtQmm/87-University-of-Hull.png"
    }
    
  ]

  
  